#include <iostream>  // Підключення бібліотеки введення/виведення
#include <cmath>  // Підключення бібліотеки для математичних операцій
using namespace std;  // Використання простору імен std

int main () {   // Початок визначення функції main - головної функції програми

//1
cout << "PROGRAM 1\n";  // Виведення повідомлення "PROGRAM 1" у консоль
cout << "Enter the time interval in minutes: ";  // Виведення повідомлення про введення інтервалу часу в хвилинах
int m;  // Оголошення змінної m для збереження інтервалу часу в хвилинах
cin >> m;  // Зчитування інтервалу часу в хвилинах з консолі

int h = m / 60;  // Визначення кількості годин у введеному інтервалі
int rest = m % 60;  // Визначення кількості хвилин, що залишились після визначення годин

cout << "This time interval in hours and minutes: " << h << " h " << rest << " min" << endl;  // Виведення результату перетворення інтервалу часу у години та хвилини

//2
float x1, y1, x2, y2, x3, y3;  // Оголошення змінних для координат трьох точок
cout << "PROGRAM 2\n";  // Виведення повідомлення "PROGRAM 2" у консоль
cout << "Enter the coordinates of the first point: ";  // Виведення повідомлення про введення координат першої точки
cin >> x1 >> y1;  // Зчитування координат першої точки з консолі
cout << "Enter the coordinates of the second point: ";  // Виведення повідомлення про введення координат другої точки
cin >> x2 >> y2;  // Зчитування координат другої точки з консолі
cout << "Enter the coordinates of the third point: ";  // Виведення повідомлення про введення координат третьої точки
cin >> x3 >> y3;  // Зчитування координат третьої точки з консолі

double S = 0.5 * abs(x1 * (y2 - y3) + x2 * (y3 - y1) + x3 * (y1 - y2));  // Обчислення площі трикутника за формулою Герона
cout << "The area of the triangle = " << S;  // Виведення обчисленої площі трикутника

return 0;  // Повернення значення 0, що вказує на успішне завершення програми
}
