#include <iostream> // Підключення бібліотеки введення/виведення
#include <cmath> // Підключення бібліотеки математичних функцій
using namespace std; // Використання простору імен std - це дозволяє використовувати всі класи та функції з стандартної бібліотеки С++

int main () {  // Початок визначення функції main - головної функції програми

    const double a = 0.7; // Оголошення та ініціалізація константи a
    const double b = 0.05; // Оголошення та ініціалізація константи b
    const double x = 0.43; // Оголошення та ініціалізація константи x

    // Обчислення значення виразу R за заданою формулою
    double R = (x*x*(x+1)) / (b-(sin(x-a)*sin(x-a)));
    
    // Обчислення значення виразу S за заданою формулою
    double S = sqrt((x*b)/a) + fabs(cos(pow(x+b, 3)));
    
    // Виведення значення R
    cout << "R = " << R << endl;
    
    // Виведення значення S
    cout << "S = " << S;

    return 0; // Повернення нульового значення - індикація успішного завершення програми
}
