// 2) ++m>--n

#include <iostream>
#include <cmath>
using namespace std;

int main(){

        int m, n;
        cout << "Enter m: " << endl;
        cin >> m;
        cout << "Enter n: " << endl;
        cin >> n;
        ++m;
        --n;
//  ++m>--n = означає що значення m збільшене на 1, має бути більшим за значення n зменшене на 1
        // Використовую оператор if, з умовою (m > n), якщо рівність справджується, то виводить cout нижче.
        if (m > n){
        cout << "Знайчення виразу m > за значення виразу n. " << (m > n) << endl;  
        // Використовую оператор else if, з умовою (m < n), за умови , якщо умова вище несправджується, і виводить cout нижче. 
        } else if (m < n){
        cout << "Знайчення виразу m < за значення виразу n. " << (m < n) << endl;
        // Використовую вдруге оператор else if, з умовою (m = n), за умови , якщо обидві умови вище несправджуються, і виводить cout нижче.
        } else if (m == n){
        cout << "Знайчення виразу m = значення виразу n. " << (m = n) << endl;
        } 

return 0;
}

