#include <iostream>
#include <cstring>

using namespace std;

void reverseWord(char* word) {//функція отримує вказівник на масив символів,функція очікує отримати показник на перший символ слова, яке потрібно перевернути
    int len = strlen(word);//обчислює кількість символів в рядку за допомогою функції
    for (int i = 0; i < len / 2; ++i) {//проходить через половину слова
        char temp = word[i];//кожен символ на позиціїї і - зберігається у змінній темп
        word[i] = word[len - i - 1];//символ і замінюється на той символ який знаходиться на такій самій відстані від кінця слова
        word[len - i - 1] = temp;//значення темп присвоється тепер новому символу
    }
}

int main() {
    char input[256];//створення масиву на 256 символів
    cout << "Введіть рядок тексту: ";
    cin.getline(input, 256, '.'); // зчитує рядок до крапки і зберігає в масиві

    char* word = strtok(input, " "); // Розділення рядка на слова за допомогоб роздільника(пробілу) за допомогою функції, яка кожен раз продовжує розділяти рядок з того місця де вона зупинилась

    while (word != nullptr) {
        reverseWord(word); // Навпаки слова
        cout << word << " "; // Виведення навпаки слова
        word = strtok(nullptr, " ");// програма розділяє введений текст на окремі слова, обертає кожне слово навпаки та виводить їх. Коли всі слова вже оброблені, word отримує спеціальне значення nullptr, що означає "кінець" слова, і тоді програма завершує цей цикл.
    }

    return 0;
}