#include <iostream>
#include<cmath>

using namespace std;
//Вимога 16. в коді використано параметри та аргументи функції
double Y(double x,double y)
{
//Вимога 17. в коді використано математичні операції та математичні функції  
    y=fabs(x);

    return y;
}

int main(){
//Вимога 3. в коді використана як мінімум одна дійсний з подвійною точністю змінна
double x,y,a,b;
a=-4.0;
x=a;
b=4.0;
//Вимога 9. в коді використаний while цикл
while(x<=b)
{
//Вимога 21. в коді використано оператори виведення та введення даних    
    cout << Y(x,y)<<endl;
    x += 0.5;
    
}

return 0;
}