#include <iostream>
#include <cmath>
#include <iomanip>
using namespace std;

int main() {
//Вимога 3. в коді використана як мінімум одна дійсний з подвійною точністю змінна
    double x, b, z, y;

//Вимога 10. в коді використаний for цикл (зовнішній цикл)
    for (x = 1; x <= 2; x += 0.2) 
    {
//Вимога 10. в коді використаний for цикл (вкладений цикл)        
        for (b = 2; b <= 8; b += 2) 
        {
//Вимога 17. в коді використано математичні операції та математичні функції   

            z = sqrt(4 * b + pow(x, 2)) / 2;
            y = pow(M_E, x / 2) * pow(b, x) * (cos(z) + sin(z));
//Вимога 21. в коді використано оператори виведення та введення даних
            cout << fixed << setprecision(3) << "X: " << x << "\tB: " << b << "\tZ: " << z << "\tY: " << y << endl;
        }
    }

    return 0;
}