#include <iostream>

int main() {

    // Обчислення сили струму в електричному ланцюгу
    std::cout << "Обчислення сили струму в електричному ланцюгу.\n";

    double voltage, resistance, current; // Оголошення всіх потрібних нам змінн

    // Введення початкових даних
    std::cout << "Напруга (вольт) > ";
    std::cin >> voltage; // Введення значення напруги з клавіатури

    std::cout << "Опір (Ом) > ";
    std::cin >> resistance; // Введення значення опору з клавіатури

    // Обчислення сили струму за законом Ома
    current = voltage / resistance; // Обчислення сили струму

    std::cout << "Сила струму: " << current << " Ампер.\n\n"; // Виведення сили струму на екран

    // Обчислення різниці творів для довільних чисел.
    std::cout << "Обчислення різниці творів (a * b) і (c * d) для довільних чисел.\n";

    double a, b, c, d, result; // Оголошення змінних для a, b, c, d та результату

    // Введення значень a, b, c, d
    std::cout << "Введіть значення a: ";
    std::cin >> a; // Введення значення a з клавіатури

    std::cout << "Введіть значення b: ";
    std::cin >> b; // Введення значення b з клавіатури

    std::cout << "Введіть значення c: ";
    std::cin >> c; // Введення значення c з клавіатури

    std::cout << "Введіть значення d: ";
    std::cin >> d; // Введення значення d з клавіатури

    // Обчислення різниці творів (a * b) і (c * d)
    result = (a * b) - (c * d);

    std::cout << "Різниця творів (a * b) і (c * d): " << result << std::endl; // Виведення результату на екран

    return 0;
}
