#include <iostream>
#include <vector>
using namespace std;

int main() {
    int N;
    cin >> N; // Введення кількості елементів вектора r

    vector<int> r(N); // Створення вектора розміром N для зберігання вхідних значень
    int a, b, c;

    // Заповнення вектора r введеними значеннями
    for (int i = 0; i < N; i++) {
        cin >> r[i];
    }

    cin >> a >> b >> c; // Введення чисел a, b, c

    vector<int> newR; // Створення нового вектора для зберігання елементів, відмінних від a, b, c

    // Перевірка елементів вектора r на відмінність від a, b, c та створення нового вектора newR
    for (int i = 0; i < N; i++) {
        if (r[i] != a && r[i] != b && r[i] != c) {
            newR.push_back(r[i]);
        }
    }

    int newN = newR.size(); // Отримання кількості елементів у новому векторі newR

    if (newN >= 2) {
        vector<int> M(newN - 1); // Створення вектора M розміром newN - 1

        // Обчислення сум пар елементів з нового вектора newR та зберігання їх у векторі M
        for (int j = 0; j < newN - 1; j++) {
            M[j] = newR[j] + newR[j + 1];
        }

        cout << newN - 1 << endl; // Виведення кількості елементів у векторі M

        // Виведення сум пар елементів з вектора M
        for (int j = 0; j < newN - 1; j++) {
            cout << " " << M[j];
        }
    } else {
        cout << "0" << endl; // Якщо новий вектор newR має менше двох елементів, виводиться 0
    }

    return 0;
}
