#include <iostream> // 21. Включено оператори введення та виведення даних
#include <cmath>    // 17. Включено математичні операції та функції

using namespace std;

int main() {
    double a = 0.7, b = 0.05, x = 0.5; // 2, 3. Використано змінні типу double (дійсні та з подвійною точністю)

    // Розрахунок R з використанням математичних операцій та функцій
    double R = pow(x, 3) * (x + 1) / pow(b, 2) - pow(sin(x * (x + a)), 2); // 17. Математичні операції та функції

    // Розрахунок S з використанням математичних операцій та функцій
    double S = x * b / a + pow(cos(x + b), 6); // 17. Математичні операції та функції

    // Виведення результатів
    cout << "R = " << R << endl; // 21. Використано оператори виведення даних
    cout << "S = " << S << endl; // 21. Використано оператори виведення даних

    return 0;
}