#include <iostream>
using namespace std;

int main() {
    int n; // Кількість елементів ряду
    cout << "Введіть кількість елементів ряду n: "; // Запит на введення кількості елементів
    cin >> n;

    double sum = 0.0; // Початкова сума ряду

    for (int i = 1; i <= n; ++i) {
        // Додавання елементу до суми з чергуванням знаку
        sum = (i % 2 == 0) ? -1.0 / i : 1.0 / i;
    }

    if (n > 1)
    {
        sum++;
    }
    
    cout << "Сума перших " << n << " елементів ряду: " << sum << endl; // Виведення суми
    return 0;
}
