#include <iostream> // Використали бібліотеку iostream, для роботи з виводом.
#include <cmath> // Використали бібліотеку cmath, для вирішення математичних завдань.

using namespace std; // Використали простор імен std;

int main() {
float a = 0.7; // Відоме значення a, яке було вказане в умові.
float b = 0.05; // Відоме значення b, яке було вказане в умові.
float x = 0.43; // Відоме значення x, яке було вказане в умові.
float rFirst, rSecond, sFirst, sSecond, sExample, rExample;
// rFirst - значення першої частини в виразі (невідомому) R;
// rSecond - значення другої в виразі (невідомому) R;
// sFirst - значення першої в виразі (невідомому) S;
// sSecond - значення другої в виразі (невідомому) S;
// Sexample - весь вираз (невідомого) S;
// Rexample - весь вираз (невідомого) R;

rFirst = (pow(x, 2) * (x + 1.0)) / b; // Присвоєння пеершій частині виразу значення, яке вказане в умові (Невідоме R)
rSecond = pow(sin(x - a), 2.0); // Присвоєння пеершій частині виразу значення, яке вказане в умові (Невідоме R)
sFirst = sqrt(x * b / a); // Присвоєння пеершій частині виразу значення, яке вказане в умові (Невідоме R)
sSecond = abs(pow(cos(x + b), 3.0)); // Присвоєння пеершій частині виразу значення, яке вказане в умові (Невідоме R)
rExample = rFirst - rSecond; // Зібрали все до купи в один вираз невідомого R;
sExample = sFirst + sSecond; // Зібрали все до купи в один вираз невідомого S;
cout << "\nЗначення виразу R = " << rExample; // Виводимо значення R.
cout << "\nЗначення виразу S = " << sExample; // Виводимо значення S.


return 0; // Завершуємо програму.
}