#include <iostream>

using namespace std;

int main() {
    // Вивід привітання та запитань для користувача
    double pi = 3.1415926535; // Змінна значення Pi.
    double radius, height; // Змінні для вводу користувачем радіусу та висоти.
    
    cout << "Введіть радіус підстави (см) > "; // Вивід повідомлення.
    cin >> radius; // Ввід радіуса користувачем.

    cout << "Введіть висоту циліндра (см) > "; // Вивід повідомлення.
    cin >> height; // Ввід висоти користувачем.
    
    double size = 2 * pi * radius * (radius + height); // Обчислення площі поверхні циліндра
    cout << "Площа поверхні циліндра: " << size << " кв.см." << endl; // Вивід результату.

    return 0;
}
