#include <iostream>
#include <cmath> // Включення бібліотеки cmath для функцій pow() та sin()
using namespace std;

int main()
{
    // Ініціалізація змінних
    double s = 0, z = 0;
    double x = 1.2, y = -0.8;

    // Розрахунок значення s
    s = 1 + x; // Ініціалізація s першим членом
    for (int i = 2; i <= 4; i++)
    {
        s += pow(x, i) / i; // Додавання наступних членів до s за допомогою операцій піднесення до степеня та ділення
    }
    cout << "s = " << s << endl;

    // Розрахунок значень a та b
    double a = pow(sin(x), 3); // Розрахунок sin(x) піднятого до степеня 3
    double b = pow(cos(y), 2); // Розрахунок cos(y) піднятого до степеня 2

    // Розрахунок значення z
    z = a + b; // Додавання значень a та b для отримання z
    cout << "z = " << z;
}
