#include <iostream>
using namespace std;

int main()
{
    // Змінні для опорів
    double r1, r2;

    // Введення даних
    cout << "Обчислення опору електричного ланцюга при\nпаралельному з'єднанні елементів.\n";
    cout << "Введіть початкові дані: " << endl;

    // Введення значень опорів від користувача
    cout << "Величина першого опору (Ом) >> ";
    cin >> r1;

    // Перевірка на коректність введених даних
    if (r1 <= 0)
    {
        cerr << "Введено некоректну величину опору. Опір повинен бути більше нуля.";
        return -1; // Помилка введення
    }

    cout << "Величина другого опору (Ом) >> ";
    cin >> r2;

    // Перевірка на коректність введених даних
    if (r2 <= 0)
    {
        cerr << "Введено некоректну величину опору. Опір повинен бути більше нуля.";
        return -1; // Помилка введення
    }

    // Обчислення та виведення результату
    double totalResistance = (r1 * r2) / (r1 + r2);
    cout << "Опір ланцюга: " << totalResistance << " Ом";
}
