#include <iostream>
#include <cmath> // Для використання функції cos()

using namespace std;

//В завданні дані деякі числа, а що це за числа - не написано. Зробив так, як зрозумів.
int main()
{
    // Вхідні дані
    double x = -3, a = 2.4;

    // Обчислення та виведення значень для різних x
    for (int i = 0; i <= 12; i++)
    {
        if (x == -1)
        {
            cout << "x = " << x << "     Error" << endl; // Виводимо помилку, бо не можна ділити на 0
            x += 0.5;
            continue;
        }
        // Обчислення та виведення значення виразу для конкретного x
        cout << "Using x: x = " << x << "     z = " << (cos(x) - 1) / (x + 1) << endl;
        x += 0.5;
    }

    // Виведення результату для конкретного a
    cout << endl << "Using a: a = " << a << "     z = " << (cos(a) - 1) / (a + 1);

    return 0;
}
