//Написати функцію sum зі змінною кількістю параметрів, що знаходить суму чисе типу int. Написати викликаючу функцію main,
// що звертається до функції sum не менш трьох разів з кількістю параметрів 3, 7, 11.

#include <iostream>


int sum(int k, ...) {
    int *p = &k;  // Націлюємо вказівник на параметр k
    int s = 0;

    for (; k != 0; k--) {
        s += *(++p);  // Збільшуємо вказівник та додаємо значення, на яке вказує вказівник
    }

    return s;
}

int main() {  // Функція main повинна бути типу int, а не void
    int result1 = sum(3, 2, 3, 4);              // Знаходить суму 2 + 3 + 4
    int result2 = sum(7, 1, 2, 3, 4, 5, 6, 7);  // Знаходить суму 1 + 2 + 3 + 4 + 5 + 6 + 7
    int result3 = sum(11, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11); // Знаходить суму 1+2+3+4+5+6+7+8+9+10+11

    std::cout << " Сума першого результату : " << result1 << std::endl; //Виводимо суму трьох результатів
    std::cout << " Сума другого результату : " << result2 << std::endl;
    std::cout << " Сума третього результату : " << result3 << std::endl;

    return 0;  // Повертаємо 0 для успішного завершення програми
}