// в коді використана як мінімум одна цілочисельна змінна
// в коді використана як мінімум одна дійсна змінна
// в коді використана як мінімум одна дійсний з подвійною точністю змінна
// в коді використана як мінімум одна цілочисельна константа
// в коді використані умовні оператори та розгалуження
// в коді використаний одновимірний масив 
// в коді використаний двовимірний масив 
// в коді використаний do while цикл
// в коді використаний while цикл
// в коді використаний for цикл 
// в коді використано оператори break і continue
// в коді використано перевантаження функції 
// в коді використано рекурсивну функцію 
// в коді використано параметри та аргументи функції	
// в коді використано математичні операції та математичні функції
// в коді використано функції роботи з файлами, для того, щоб записати у файл
// в коді використано функції роботи з файлами, для того, щоб зчитати з файлу
// в коді використано оператори виведення та введення даних
// в коді використано свою структуру даних
// в коді використано вказівники

// Загальні відомості
// В американській системі виміру довжин використовуються ярди, фути, дюйми. 1 Ярд = 3 фути. 1 Фут = 12 дюймів. 1 Дюйм = 2.54 см.
// Футбольні поля мають можуть мати різну довжину
// Довжина: мінімум 100 ярдів, максимум 130 ярдів.
// Ширина: мінімум 50 ярдів, максимум 100 ярдів.

// // Довжина задається по варіанту 100 - 110 -120 - 130 для кожної групи інший розмір поля. ШІ -11  100 ярдів, ШІ -12 110 ярдів … і т.д.

// Використовуючи Ваше прізвище розрахувати найменшу довжину, яка необхідна для розміщення банера з Вашим прізвищем.
//  За умови, що прізвище можна записати лише в 1 ряд, а ширина букви(разом з інтервалом між символами) = кількості голосних букв у Вашому прізвищі * 0.8 метра.
// На основі обчислених розмірів букви визначити символи, які будуть знаходитись на 3-х центральних(по довжині) метрах поля. 
// Обчислення зробити для 2-х випадків:
// 1) при написанні прізвища з лівого краю поля —>  до правого
// 2) при написанні прізвища з правого краю поля <—  до лівого.
// Результат записати.


#include <iostream>
#include <vector>
#include <string>

using namespace std;

int main() {

    string lastname;
    cout << "Введіть ваше прізвище: "<< endl;
    getline(cin, lastname);

    vector<char> chrlastname;

    cout << "Ваше прізвище по буквам: ";

    for (int i = 0; i < lastname.length(); i++) {  // - циклом розбиваємо строку на масив символів
        chrlastname.push_back(lastname.at(i));
        cout << chrlastname[i] << " "; 
    }

    int sum_of_letters = 0; // - кількість голосних букв

    for (int i = 0; i < chrlastname.size(); i++) {
        if (chrlastname[i]=='O' || chrlastname[i]=='o' ||
            chrlastname[i]=='A' || chrlastname[i]=='a' ||
            chrlastname[i]=='U' || chrlastname[i]=='u' ||
            chrlastname[i]=='I' || chrlastname[i]=='i' ||
            chrlastname[i]=='E' || chrlastname[i]=='e' ||
            chrlastname[i]=='Y' || chrlastname[i]=='y') {

                sum_of_letters++;
            }
    }

    float size_of_letter = sum_of_letters * 0.8;
    cout << endl << "Кількість голосних букв у вашому прізвищі: " << sum_of_letters;
    cout << endl << "Розмір букви на полі в метрах: " << size_of_letter;

    const int fieldsize = 100; // - задано довжину поля у ярдах, вона незмінна, тому використаємо константу

    double fsize_in_metres = fieldsize * 3 * 12 * 2.54; // - рахуємо довжину поля в метрах
    cout << endl << "Довжина всього поля в метрах: " << fsize_in_metres;

    float letters_on_field = fieldsize/size_of_letter; // - кількість букв на полі
    cout << endl << "Кількість букв на полі: " << letters_on_field << endl;

    int a; 

    for (int i = 0; i < 41; i++) {
        if(i > 8) {
            a = i%8;
            cout << chrlastname[a];
        }
        else cout << chrlastname[i];
    }
   
    return 0;
}