//Загальні відомості
//В американській системі виміру довжин використовуються ярди, фути, дюйми. 1 Ярд = 3 фути. 1 Фут = 12 дюймів. 1 Дюйм = 2.54 см.
//Футбольні поля мають можуть мати різну довжину
//        Довжина: мінімум 100 ярдів, максимум 130 ярдів.
//Ширина: мінімум 50 ярдів, максимум 100 ярдів.

// Довжина задається по варіанту 100 - 110 -120 - 130 для кожної групи інший розмір поля. ШІ -11  100 ярдів, ШІ -12 110 ярдів … і т.д.

//Використовуючи Ваше прізвище розрахувати найменшу довжину, яка необхідна для розміщення банера з Вашим прізвищем.
//За умови, що прізвище можна записати лише в 1 ряд, а ширина букви(разом з інтервалом між символами) = кількості голосних букв у Вашому прізвищі * 0.8 метра.
//На основі обчислених розмірів букви визначити символи, які будуть знаходитись на 3-х центральних(по довжині) метрах поля.
//Обчислення зробити для 2-х випадків:
//1) при написанні прізвища з лівого краю поля —>  до правого
//2) при написанні прізвища з правого краю поля <—  до лівого.
//Результат записати.

#include <iostream>
#include <string>


int main() {
    int field = 130;
    double field_m = (field * 3 * 12 * 2.54) / 100;
    std::string surname;
    std::cin >> surname;
    int vowel = 0;
    char vowels[] = {'a', 'e', 'i', 'o', 'u', 'y'};
    char letters[] = {'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o',
                      'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z'};
    int vowelsSize = sizeof(vowels) / sizeof(vowels[0]);
    for (char &c: surname) {
        for (int i = 0; i < vowelsSize; ++i) {
            if (c == vowels[i]) {
                vowel++;
                break;
            }

        }
    }
    int countL = surname.length();
    double letterSize = vowel * 0.8;
    double surname_lenght = letterSize * countL;
    int surname_number = field_m / surname_lenght;
    std::cout<< letterSize<<std::endl;
    std::cout<< surname_lenght<<std::endl;
    std::cout<< surname_number;
    return 0;
}
