#include<iostream>
using namespace std;

int main()
{   
    double a, b, c;
    cout<<"Обчислення площі поверхні паралелепіпеда"<<endl<<endl<<"Введіть початкові дані:";
    
    cout<<endl<<"Довжина (см) : ";
    cin>>a;
    
    cout<<"Ширина (см) : ";
    cin>>b;
    
    cout<<"Висота (см) : ";
    cin>>c;

    cout<<endl<<"Площа поверхі паралелепіпеда у сантиметрах квадратних = "<<2*(a*b+b*c+c*a);
    cout<<endl<<"Площа поверхі паралелепіпеда у верстах квадратних = "<<2*(a*b+b*c+c*a)/1000/1000/1066.8/1066.8;


    return 0;
}
