#include <iostream>
#include <cmath>

using namespace std;

int main()
{
    //Задання вхідних параметрів
    int a1, a2, angle;
    double S;
    double pi = M_PI;
    cout << "Обчислення площі трикутника." << endl;
    cout << "Введіть (через пропуск) довжини двох сторін (см) трикутника > ";

    //Введення довжин двох сторін трикутника та кута між ними
    cin >> a1 >> a2;
    cout << "Введіть величину кута між сторонами трикутника > ";
    cin >> angle;

    //Переведення кута в радіани
    double angleRadian;
    angleRadian = (pi * angle) / 180;

    //Обчислення площі трикутника
    S = 0.5 * a1 * a2 * sin(angleRadian);

    //Виведення результатів
    cout << "Площа трикутника: " << S << " кв.см." << endl;


    cout << endl;

    //Задання вхідних параметрів
    int H, B, S2, count, bolt = 2;
    double V;
    cout << "Обчислення o6'єму ящика." << endl;

    //Введення висоти, ширини та довжини ящика
    cout << "Введіть (через пропуск) висоту, ширину i довжину (см) ящика > ";
    cin >> H >> B >> S2;

    //Обчислення об'єму ящика та кількості болтів, які можна розмістити в ящику
    V = H * B * S2;
    count = V / bolt;

    //Виведення результатів
    cout << "B ящику " << count << " болтів";

    return 0;
}