#include <iostream>  // Підключення бібліотеки для введення та виведення даних
#include <cmath>     // Підключення бібліотеки для математичних функцій
using namespace std; // Використання простору імен std

int main(){
    double V, S, r;                        // Оголошення зміних типу double 
    
    cout << "Enter the value of radius: "; // Вивід тексту на екран
    cin >> r;                              // Задання зміній r значення введеного через консоль

    V = fabs((3 * M_PI * pow(r, 3)) / 4); // Обчислення об'єму
    S = 4 * M_PI * pow(r, 2);             // Обчислення площі

    cout << "V = " << V << endl; // Вивід на екран результату по обчисленні об'єму
    cout << "S = " << S << endl; // Вивід на екран результату по обчисленні площі

    return 0; // Повернення 0, що свідчить про успішне завершення програми
}