#include <iostream>  // Підключення бібліотеки для введення та виведення даних
#include <cmath>     // Підключення бібліотеки для математичних функцій
using namespace std; // Використання простору імен std

int main(){
    const int a = 2, b = 3, c = 7; // Оголошення та ініціалізація констант типу int
    double x = 0, step = 0.31;     // Оголошення та ініціалізація змінних типу double
    double y;                      // Оголошення змінної типу double

    for (x = 0; x <= 5; x += step) {                   
    //Цикл, який розпочинається з 0 і виконується поки не досягне 5, початкове значення змінюється на 0.31
    
        if (x < 2) y = pow(a, b - x) + c;                 //Перша умова для знаходження у
        else if (x >= 2 && x <= 4) y = pow(b, c - x) + a; //Друга умова для знаходження у
        else y = pow(c, a - x) + b;                       //Третя умова для знаходження у

        cout << "y = " << y << endl;                      //Вивід значення y
    }

    return 0; // Повернення 0, що свідчить про успішне завершення програми
}