#include <iostream>  // Підключення бібліотеки для введення та виведення даних
#include <cstdlib>   // Підключення бібліотеки для використання генератора рандомних чисел rand()
#include <ctime>     // Підключення бібліотеки для ініціалізації генератора випадкових чисел
using namespace std; // Використання простору імен std

int main(){
    const int length = 10, min = 1, max = 10;    // Оголошення та ініціалізація констант типу int 
    double average;                              // Оголошення змінної типу double 
    int amount = 0, sum = 0;                     // Оголошення та ініціалізація зміної типу int 
    srand(static_cast<unsigned>(time(nullptr))); // Ініціалізація генератора випадкових чисел від часу

    cout << "Random numbers:\n";                     // Виводимо повідомлення на екран
    for (int i = 0; i < length; i++) {               // Використання циклу для знаходження суми елементами рандомного заповнення
        int random = rand() % (min - max + 1) + min; // Оголошення зміної і присвоєння їй рандомні рандомних чисел діапазоном від 1 до 10 кожної ітерації
        cout << random << "\t";                      // Вивід на екран рандомних чисел
        sum += random;                               // Знаходження суми рандомних чисел
        amount++;                                    // Збільшує на 1. Підраховує кількість рандомних чисел
    }
    cout << endl;                            // Перехід на новий рядок
    cout << "The sum is: " << sum << endl;   // Виведення значення суми рандомних чисел і перехід на новий рядок
    
    average = double(sum) / double(amount);  // Знаходження середнього арифметичного і переведення зміних в тип double
    cout << "Average value is: " << average;        // Вивід на екран середнього арифметичного

    return 0; // Повернення 0, що свідчить про успішне завершення програми
}