//1. створити констатнту яка дорівнює номеру вашого пулл реквесту в 7-му епіку і якщо вона парна то:
//	а. написати та викликати функцію, яка створить та поверне матрицю розміром 10*10 і буде заповнена значеннями з певної математичної функції і повертає числа з плаваючою крапк

//	2. отриману матрицю потрібно передати як параметр іншій створеній та перевантаженій функції, яка має два варіанти реалізації:
//	а. таку що отримує матрицю з числами з плаваючою крапкою, та отримує значення з плаваючою крапкою 
//		(ця функція має сортувати стовпці по зростанню методом бульбашки та повертати матрицю)
//	b. таку що отримує матрицю з цілими числами, та отримує ціло-чисельне значення 
//		(ця функція має сортувати рядки по спаданню методом бульбашки та повертати матрицю)
//(другий параметр при виклику функції це, або значення пулл реквесту, або добуток значення пулл реквесту та числа з плаваючою крапкою, що вводиться з консолі)

#include <iostream>
#include <math.h>

using namespace std;


const int numrows = 10;
const int numcols = 10;//Вимога №1.в коді використана як мінімум одна цілочисельна константа, це вказання розміру масиву
float arr[numrows][numcols];//Вимога №2в коді використаний двовимірний масив, його ініціалізація
const int katya = 934;

void matrics(){
    for(int rows = 0; rows < numrows; rows++){//Вимога №3.в коді використаний for цикл, необхідний для занесення данних в масив. 
        for(int cols = 0; cols < numcols; cols++){
            arr[rows][cols] = pow(rows, cols)*katya;//Вимога №4.в коді використано математичні операції та математичні функції, pow - функція піднесення до степеню.
        }//в коді використано оператори виведення та введення даних

    }
}
void matrics(float arr[numrows][numcols]){//Вимога №5.в коді використано перевантаження функції
    for(int col = 0; col < cols, col++){
        for(int i = 0; i < rows - i - 1; i++){
            for(int j = 0; j < rows - i - 1; j++){
                if(arr[j][col] > arr[j + 1][cols]){//Вимога №6.в коді використані умовні оператори та розгалуження
                    float h = arr[j][cols];
                    
                }
            }
        }
    }

}



int main(){
    matrics();
    for(int rows = 0; rows < numrows; rows++){//Вимога №6.в коді використаний for цикл, необхідний для занесення данних в масив, необхідний дле виведення данних
        for(int cols = 0; cols < numcols; cols++){
            cout<<arr[rows][cols]<<"\t";// коді використано оператори виведення та введення даних, конкретно виведення масиву

            
        }
        cout<<endl;
    }
    
}