#include <iostream>

using namespace std;

int main()
{
    // Оголошення змінної для величини внеску
    double v;
    // Вивітання користувача та введення суми внеску
    cout<<"Вас вітає банк Альфа-Омега!\n";
    cout<<"Ваш внесок: ";
    cin>>v;
    // Перевірка на нульову чи від*ємну суму внеску 
    if(v <= 0){
        cout<<"Ви не можете внести таку суму!\n";
        return 1;
    }
    // Розрахунок суми внеску після 2-х перерахунків (зі зростанням на 3% щорічно)
    for(int i = 1; i <= 2; i++){
        double h;
        h = (3*v)/100; // Розрахунок відсотків
        v += h; // Додавання відсотків до суми внеску
    }
    // Виведення суми внеску після 2-х перерахунків
    cout<<"Сума внеску після 2-х перерахунків: " << v;
    

    return 0;
}
