#include <iostream>
#include <string>

using namespace std;

int main() {
    string input; // Змінна, для зберігання введений символів.
    cin >> input;
    string S_compressed; // Змінна, для збереження стиснутого рядка (тобто компресії)
    
    // Змінна для визначення кількості однакових символів
    int count = 1;
    // Цикл, який проходить через кожний символ, який введений у рядку.
    for (int i = 0; i < input.length(); i++) {
        // Перевіряємо, чи це перший символ або він відрізняється від попереднього
        if (i == 0 || input[i] != input[i - 1]) { // Умова, яка перевіряє, чи поточний символ відрізняється від попереднього або чи це перший символ у рядку.
            if (count > 1) { // Перевіряємо, якщо к-сть однакових символів > 1, то зберігаємо до змінної S_compressed.
                S_compressed += to_string(count);
            }
            
            S_compressed += input[i]; // Додаємо поточний символ до змінної S_compressed.
            
            count = 1; // Скидаємо лічильник, оскільки переходимо до іншого символу.
        } else {
            // Якщо поточний символ той самий, що і попередній, збільшуємо лічильник count.
            count++;
        }
    }
    // Додаємо кількість останніх символів, якщо вони більше 1
    if (count > 1) {
        S_compressed += to_string(count); // Додаємо к-сть однакових симоволів (якщо вони більші за 1) до змінної S_compressed.
    }
    // Виводимо стиснутий рядок
    cout << S_compressed << endl;
    return 0;
}
