#include <iostream> 
#include <string>   
using namespace std;


bool isPalindrome(const string& str, int start, int end) { // Рекурсивна функція, яка перевіряє, чи заданий рядок є паліндромом.
    if (start >= end) { // Перевіряємо, чи дойшли до кінця області рядка, для перевірки паліндрома. (Тобто start >= end)
        return true; // Якщо, умова справдилась, виклик рекурсивної функції зупиняється, і повертається значення true. (Тобто, рядок який залишився для перевірки, складається лише з одного символу або є пустим, і тому вона вважається паліндромом.)
    }

    if (str[start] == str[end]) { // Перевіряємо чи перший символ (позиція старт) = остананньому символу (позиція end)
        return isPalindrome(str, start + 1, end - 1); // Якщо умова виконується, то функція викликає саму себе (тобто рекурсія), і збільшує початкову позицію на 1, та зменшує кінцеву на 1.
    }

    return false; // Якщо хоча б один символ не співпадає, то рядок не є паліндромом
}

bool isPalindrome(int num) { // Перевантажена функція для цілих чисел
    string numStr = to_string(num); // Перевторюємо ціле число (num) в рядок (string). Використовуємо для цього функцію to_string 
    // Використовуємо рядкову версію функції для перевірки, чи це паліндром
    return isPalindrome(numStr, 0, numStr.length() - 1); // Таким чином, ми використовуємо рекурсивну функцію, яка вже була визначена для рядків, для перевірки, чи ціле число є паліндромом.
}

int main() {
    
    string strExample;
    int numExample;
    cout << "Введіть симовольне значення на перевірку, чи є воно паліндромом:" << endl;
    cin >> strExample;
    cout << "Введіть чисельне значення на перевірку, чи є воно паліндромом:" << endl;
    cin >> numExample;
    
    if (isPalindrome(strExample, 0, strExample.length() - 1)) { // Виклик функції з параметрами, для перевірки на паліндром усього рядка, з першого (srtExample, 0) до останнього символу (strExample.length() - 1).
        cout << "Слово: " << strExample << " є паліндромом." << endl;
    } else {
        cout << "Слово: " << strExample << " не є паліндромом." << endl;
    }
    
    if (isPalindrome(numExample)) { // Виклик функції, для перевірки числа на паліндром. Тобто функція перетворює ціле число в рядок і викликає рекурсивну функцію для перевірки паліндрома цього рядка.
        cout << "Число: " << numExample << " є паліндромом." << endl;
    } else {
        cout << "Число: " << numExample << " не є паліндромом." << endl;
    }
    return 0;
}
