#include <iostream>
#include <cstdlib>
#include <ctime>
#include <algorithm>

using namespace std;

int main() {
    int arraySize = 10; // Оголошую масив array з роміром на 10 елементів.

    int array[arraySize]; // Оголошую масивy з розміром arraySize, який ми визначили вище.

    // Заповнення масиву випадковими числами
    srand(static_cast<unsigned int>(time(0))); // Ініціалізуємо генератор випадкових чисел за допомогою поточного часу. Використовуємо static_cast<unsigned int>, оскільки srand очікує беззнаковий цілочисельний аргумент.
    // Цикл, який проходить через всі елементи масиву і заповнює їх випадковими числами від 0 до 20.
    for (int i = 0; i < arraySize; ++i) { 
        array[i] = rand() % 20; // Генеруємо числа від 0 до 20.
    }

    // Роздруковуємо початковий масив
    cout << "Початковий масив: "; // Виводимо повідомлення про те, що ми виводимо початковий масив.
    // Цикл, який виводить на екран всі елементи масиву.
    for (int i = 0; i < arraySize; ++i) { 
        cout << array[i] << " ";
    }
    cout << endl; // Перевів рядок для зручності виведення.

    // Знаходимо мінімальне значення в масиві
    int minValue = *min_element(array, array + arraySize); //  Знаходимо мінімальне значення в масиві за допомогою min_element та зберігаю його у змінній minValue.

    // Видаляємо всі елементи, які співпадають з мінімальним значенням
    int* newEnd = remove(array, array + arraySize, minValue); // Переміщаємо всі елементи масиву, які = minValue, в кінець масиву, але не видаляємо їх фізично. Результат remove є ітератором, що вказує на початок "зменшеного" масиву.
    arraySize = distance(array, newEnd); // Оновлюємо arraySize до нового розміру масиву після видалення елементів, використовуючи distance.

    // Знаходимо середнє арифметичне масиву
    double average = 0.0; // Ініціалізація зміннної average для обчислення середнього арифметичного.
    // Цикл, який сумує всі елементи масиву для подальшого обчислення середнього арифметичного.
    for (int i = 0; i < arraySize; ++i) {
        average += array[i];
    }
    average /= arraySize;

    // Додаємо три нових елементи на початок масиву, кожен із значенням середнього арифметичного (заокругленого до цілого числа).
    for (int i = 0; i < 3; ++i) {
        array[i] = static_cast<int>(average);
    }
    cout << "Змінений масив: "; // (Родруковуємо) Виводимо змінений масив.
    
    // Цикл, який виводить на екран всі елементи зміненого масиву.
    for (int i = 0; i < arraySize; ++i) {
        cout << array[i] << " ";
    }
    
    return 0;
}
