// Юний скарбошукач Рома пройшов курс навчання за спеціальністю "скарбова справа", і тепер проходить літню практику. Літня практика проходиьт поблиуз селища "Кам'яні Зорі" і триває рівно b днів. Кожен день Рома знаходить a закопаних в околицях монет. Таким чином, у кінці першого дня у нього було a монет, у кінці другого 2 * a, а по завершенню практики у Роми повинно накопитись b * a монет.

// Якщо у кінці дня черговий викладач помічав, що кількість Роминих монет ділиться на b, то Ромі дозволялось взяти з полички пиріжок, який він відразу ж і з'їдав. Допоможіть Ромі порахувати, скільки пиріжків він з'їсть за час проходження практики.

// Вхідні дані
// Два цілих числа a та b (1 ≤ a, b ≤ 10^9).

// Вихідні дані
// Виведіть кількість пиріжків, які з'їсть під час практики Рома.

#include <iostream>

using namespace std;

int gcd(int a, int b) {
    while (b != 0) {
        int temp = b;
        b = a % b;
        a = temp;
    }
    return a;
}

int main() {
    int a, b;
    cin >> a >> b;
    cout << gcd(a, b) << endl;
    return 0;
}
