// Варіант 15 
#include <iostream>
#include <cmath>

using namespace std;

// Функція для розрахунку fi
// 16. в коді використано параметри та аргументи функції
double calculate_fi(double m, double c, double x) {
    // 17. в коді використано математичні операції та математичні функції 
    return sqrt(m * tan(x) + fabs(c * sin(x)));
}

// Функція для розрахунку ksi
// 16. в коді використано параметри та аргументи функції
double calculate_ksi(double m, double c, double x, double b) {
    // 17. в коді використано математичні операції та математичні функції
    return m * cos(b * x + sin(x)) + pow(c, 3);
}

int main() {
    int m = 2; // 1. в коді використана як мінімум одна цілочисельна змінна
    const int c = 1; // 4. в коді використана як мінімум одна цілочисельна константа
    float x = 1.2; // 2. в коді використана як мінімум одна дійсна змінна
    double b = 0.7; // 3. в коді використана як мінімум одна дійсний з подвійною точністю змінна

    // 16. в коді використано параметри та аргументи функції
    double fi = calculate_fi(m, c, x); 
    double ksi = calculate_ksi(m, c, x, b);  

    // 21. в коді використано оператори виведення та введення даних
    cout << "fi = " << fi << endl; 
    cout << "ksi = " << ksi << endl; 

    return 0;
}
