// Варінт 6
#include <iostream>

using namespace std;

int main() {
    // 1. в коді використана як мінімум одна цілочисельна змінна
    int n;
    int sum = 0;

    // 21. в коді використано оператори виведення та введення даних
    cout << "Введіть кількість чисел для підсумовування: ";
    cin >> n;

    // Обчислення суми парних чисел
    for (int i = 2; i <= 2 * n; i += 2) {
        sum += i;
    }

    // 21. в коді використано оператори виведення та введення даних
    cout << "Сума перших " << n << " парних чисел: " << sum << endl;

    return 0;
}
