// Варіант 20, задача 2
#include <iostream>
#include <cmath>

using namespace std;

int main() {
    // 3. в коді використана як мінімум одна дійсний з подвійною точністю змінна
    double radius;

    // 21. в коді використано оператори виведення та введення даних
    cout << "Введіть радіус кулі > ";
    cin >> radius;


    // 17. в коді використано математичні операції та математичні функції

    // Обчислення об'єму кулі
    double volume = (3.0 / 4.0) * M_PI * pow(radius, 3);

    // Обчислення площі поверхні кулі
    double surfaceArea = 4 * M_PI * pow(radius, 2);


    // 21. в коді використано оператори виведення та введення даних
    cout << "Об'єм кулі: " << volume << " кубічних одиниць" << endl;
    cout << "Площа поверхні кулі: " << surfaceArea << " квадратних одиниць" << endl;

    return 0;
}
