#include <iostream>

using namespace std;

int main()
{
    int a = 1; // 1)цілочислена змінна

    float b; // 2)дійсна змінна

    double c; // 3)дійсна змінна з подвійною точністю

    const int d = 5; // 4)цілочислена константа

    if (b > c)
    { // 5)умовний оператор if
        a++;
    }
    else
    { // 6)розгалуження якщо(if) умова виконує першу умову то виконується перша дія якщо не виконується(else) виконується друга дія
        a--;
    }

    int mas1[5] = {1, 2, 3, 4, 5}; // 7)одновимірний масив

    int mas2[2][3] = {{1, 3, 5}, // 8)двовимірний масив
                      {7, 9, 4}};
    do{                         // 8) цикл do while
        cout <<"Завдання 8\n";
    }
    while( c == 6);
    
    int y = a - 3;
    while(y<a) { // 9)цикл while
        cout <<"Завдання 9\n";
        y++;
    }

    for (int i = 0;i<d;i++){ // 10)цикл for
        cout <<"Завдання 10\n";
    }
    
    for (int i = 0;i<d;i++){
    if
    }
    return 0;
}