#include <iostream> // Підключення бібліотеки для введення/виведення на консоль
#include <cmath>    // Підключення бібліотеки для математичних функцій
using namespace std; // Використання простору імен std

int main() {
    cout << "The table of squares will look like this:" << endl; // Вивід заголовку таблиці
    cout << "Number\tSquare" << endl; // Вивід заголовків стовпців таблиці

    int i = 1;  // Ініціалізація лічильника i з початковим значенням 1
    for (i; i <= 10; ++i) { // Початок циклу, який виводить квадрати чисел від 1 до 10
        int sq = pow(i, 2); // Обчислення квадрату поточного числа і
        cout << i << "\t" << sq << endl; // Вивід поточного числа та його квадрату у вигляді рядка таблиці
    }

    return 0; // Успішне завершення програми
}
