#include <iostream> // Підключення бібліотеки для введення/виведення на консоль
#include <cmath>    // Підключення бібліотеки для математичних функцій
using namespace std; // Використання простору імен std

int main() {
    // Оголошення та ініціалізація змінних типу double
    double a = 10.2;
    double b = 9.3;
    double x = 2.4;
    double c = 0.5;
    double K = log(a + pow(x, 3)) + pow(sin(x / b), 2); // Обчислення шуканого К за допомогою формул
    cout << "K equals: " << K << endl; // Виведення значення K
    double q = cbrt(x + a); // Обчислення кубічного кореня з виразу
    double m = fabs(x - b); // Обчислення модуля з виразу
    double M = exp(-c * x) * (x + q / (x - sqrt(m))); // Обчислення шуканого виразу M за допомогою попередньо написаних q та m 
    cout << "M equals: " << M << endl; // Виведення значення M

    return 0; // Успішне завершення програми
}
