#include <iostream> // підключення бібліотеки для введення/виведення
#include <cmath> // підключення бібліотеки для математичних обчислень

using namespace std; // використання простору std для уникнення повторень в коді

int main() { // початок головної ф-ції 
    double a = 10.2;  // оголошення та ініціалізація типу змінних double, використано дійсні змінні
    double b = 9.3;
    double x = 2.4;
    double c = 0.5;
    
    double K = log(a + pow(x, 3)) + pow(sin(x / b), 2); //обчислення значення К, використано математичні операції у виразах log, pow, sin і тд.

    double M = exp(1) * pow(c * x, 3) * ((x + cbrt(x + a)) / (x - sqrt(fabs(x - b)))); // обчислення значення M, використано математичні операції у виразах log, pow, sin і тд.

    cout << "K = " << K << endl; // виведення значення К на екран, використано оператор вивеення cout
    cout << "M = " << M << endl; // виведення значення M на екран, використано оператор вивеення cout

    return 0; // завершення головної ф-ції, повернення значення 0.
}
