#include <iostream> // підключення бібліотеки для введення/виведення
using namespace std; // використання простору std для уникнення повторень в коді

int main() {  // початок головної ф-ції

    double length, width, height;  // оголошення та ініціалізація типу змінних double, використано дійсні змінні

    // Запитуємо користувача ввести дані
    cout << "Введіть довжину, ширину і висоту паралелепіпеда: "; // виведення запиту для користувача на екран, використано оператор вивеення cout
    cin >> length >> width >> height;  //введення довжини, ширини та висоти паралелепіпеда, використано оператор вивеення cin

    double volume = length * width * height; //обчислення об'єму паралелепідела, використано дійсні змінні
    cout << "Об'єм паралелепіпеда " << volume << " см.куб." << endl;  //виведення результату на екран, використано оператор вивеення cout

    return 0; // завершення головної ф-ції, повернення значення 0.
}
