#include <iostream> // підключення бібліотеки для введення/виведення
using namespace std; // використання простору std для уникнення повторень в коді

int main() { // початок головної ф-ції
    cout << "Введіть число: "; // повідомлення для ввеення чисел, використано оператор вивеення cout
    int number; // оголошення та ініціалізація типу змінних int, використано цілочисельні змінні
    cin >> number; //введення чисел, використано оператор вивеення cin
 
    int sum = 0; // оголошення та ініціалізація типу змінних int, використано цілочисельні змінні
    int remainder;

    while (number > 0) {  //використано цикл while для обчислення суми цифр числа
        remainder = number % 10; // отримання останньої цифри числа
        sum += remainder; //додавання цифри до суми
        number /= 10; //видалення останньої цифри числа
    }
    cout << "Сума цифр числа: " << sum << endl; // виведення результату, використано оператор виведення

    return 0; // завершення головної ф-ції, повернення значення 0.
}
