#include <iostream>
using namespace std;

int main() {
    double notebook, cover, total; //В коді використана як мінімум одна дійсна з подвійною точністю змінна
    int num; //В коді використана як мінімум одна цілочисельна змінна
    
    cout << "Обчислення вартості покупки." << endl;//В коді використано оператори виведення та введення даних
    cout << "Введіть початкові дані:" << endl;//В коді використано оператори виведення та введення даних

    do {
        cout << "Ціна зошита (грн.) > ";//В коді використано оператори виведення та введення даних
        cin >> notebook;//В коді використано оператори виведення та введення даних
    } while (notebook < 0);//В коді використаний do while цикл

    do {
        cout << "Ціна обкладинок (грн.) > ";//В коді використано оператори виведення та введення даних
        cin >> cover;//В коді використано оператори виведення та введення даних
    } while (cover < 0);//В коді використаний do while цикл

    do {
        cout << "Кількість комплектів > ";//В коді використано оператори виведення та введення даних
        cin >> num;//В коді використано оператори виведення та введення даних
    } while (num < 0);//В коді використаний do while цикл

    total = (notebook + cover) * num;

    if (total == 0) { //В коді використані умовні оператори та розгалуження
        cout << "Товари не придбано." << endl;//В коді використано оператори виведення та введення даних
    } else {
        cout << "Вартість покупки: " << total << " грн." << endl;//В коді використано оператори виведення та введення даних
    }

    return 0;
}