#include <iostream>
#include <iomanip> //підключаю для використання setprecision


using namespace std;


int main(){
    int distance;
    float consumption, price;


    cout << "  Обчислення вартості поїздки на дачу і назад" << endl;
    cout << "Введіть початкові дані:" << endl;
    cout << "Відстань до дачі (км): ";
    cin >> distance; //вводимо відстань до дачі
    cout << "Витрата бензину (літрів на 100 км пробігу): ";
    cin >> consumption; //вводимо розхід палива
    cout << "Ціна літра бензину (грн): ";
    cin >> price; //вводимо ціну 1 літрa палива


    int total_distance = distance*2; //шукаємо загальну відстань (відстань до дачі і назад)
    float petrol = total_distance*consumption/100; //обчислюємо скільки літрів палива витратиться на поїздку
    float total_price = petrol*price; //обчислюємо ціну на цей об'єм палива


    cout << "Поїздка на дачу і назад обійдеться в " << fixed << setprecision(2) << total_price << " грн." << endl; //виводимо результат; використано setprcision для виведення 2-ох знаків після коми


    cout << endl << "  Обчислення сили струму" << endl; //завдання з обчисленням сили струму
    float i, u, r;
    cout << "Введіть значення опору у Ом: ";
    cin >> r; //вводимо значення опору
    while(r<=0) //створив цикл; якщо користувач введе від'ємний або нульовий опір, то просимо його ввести ще раз поки він не введе додатнє значення
    {
        cout << "Опір не може бути від'ємним чи дорівнювати нулю. Введіть ще раз значення опору: ";
        cin >> r;
    }
    cout << "Введіть значення напруги у В: ";
    cin >> u; //вводимо значення напруги
    i = u/r; //знаходимо силу струму за законом Ома
    cout << "Сила струму дорівнює " << setprecision(3) << i << " A" << endl; //виводимо силу струму у амперах, використовуючи setprecision для виведення трьох знаків після коми
    return 0;
}
