#include <iostream>
#include <cmath> //підключаю заголовковий файл cmath, щоб мати змогу прауювати з математичними функціями

using namespace std;



int main(){
    double a=0.1, x=0.5, y; //ініціалізую змінним a, x початкові значення
    const double hx = 0.2, ha = 0.3, eps = 1e-9; //hx - крок, на який змінюється х; ha - крок, на який змінюється а; eps - змінна з дуже малим значенням для порівняння чисел типу double

    while(x<=3.1 + eps) //цикл для обчислення функції в залежності від значень а та х, які змінюються; за умовою x>=0.5 та x<=3.1
    {
        if(a<=2) //якщо а<=2, то у визначається однією функцією
        {
            y = tan(abs(x-2*a)); //використовую функцію обчислення тангенса та модуль
        } else{ //якщо a>2, то у визначається іншоб функцією
            y = cos(a*x+2); //використовую функцію обчислення косинуса
        }
        cout << "x = " << x << "\t\ta = " << a << "\t\ty = " << y << endl; //виводжу результати у кожній ітерації циклу
        x+=hx; //збільшую х на його крок
        a+=ha; //збільшую a на його крок
    }
    return 0;
}