#include <iostream>
#include <cmath> //зазначаю бібліотеку для того, щоб можна було виконувати деякі арифметичні операції
using namespace std;

int main()
{
    double x, y, z, u, v; // використовую цей тип даних для найбільшої точності, так як просто float видасть не точне значення
    x=1.82;
    y=18.5;
    z=-3.4;
    u=y-x; //використовую допоміжні змінні для зручності
    v=y/x;

    double a=pow(x, v)-pow(v,1.0/3.0); //обчислюю спочатку значення під подулем
    double gamma = abs(a); //зі знайденого значення знаходжу модуль за допомогою функції abs - абсолютне значення
    double fi=(x-y)*(y-z/u)/(1+pow(u,2));

    cout<<gamma<<"\n";//вивід відповіді
    cout<<fi<<"\n";

    return 0;
}