/*Загальні відомості
В американській системі виміру довжин використовуються ярди, фути, дюйми. 1 Ярд = 3 фути. 1 Фут = 12 дюймів. 1 Дюйм = 2.54 см.
Футбольні поля мають можуть мати різну довжину
Довжина: мінімум 100 ярдів, максимум 130 ярдів.
Ширина: мінімум 50 ярдів, максимум 100 ярдів.

// Довжина задається по варіанту 100 - 110 -120 - 130 для кожної групи інший розмір поля. ШІ -11  100 ярдів, ШІ -12 110 ярдів … і т.д.

Використовуючи Ваше прізвище розрахувати найменшу довжину, яка необхідна для розміщення банера з Вашим прізвищем.
За умови, що прізвище можна записати лише в 1 ряд, а ширина букви(разом з інтервалом між символами) = кількості голосних букв у Вашому прізвищі * 0.8 метра.
На основі обчислених розмірів букви визначити символи, які будуть знаходитись на 3-х центральних(по довжині) метрах поля. 
Обчислення зробити для 2-х випадків:
1) при написанні прізвища з лівого краю поля —>  до правого
2) при написанні прізвища з правого краю поля <—  до лівого.
Результат записати.*/
#include <iostream>
using namespace std;

int main (){
    //1.	в коді використана як мінімум одна цілочисельна змінна
    int yard = 120, 
    count = 0;
    //3.	в коді використана як мінімум одна дійсний з подвійною точністю змінна
    double sm = yard*12*2.54,
    start = (yard-3)/2,
    end = (yard+3)/2;
    //2.	в коді використана як мінімум одна дійсна змінна
    float width = 3*0.8,
    width2 = 10*width;
    //polishchuk - o, i, u - (3), кількість букв - 10;
    if (true){
        if ()
    }
}