#include <iostream> //дозволяє використовувати виведення(cout) і введеня(cin)

using namespace std;

void resistance(){  //дозволяє більш зручно користуватися програмою та читати код 
     int res1, res2; //задаю змінні типу int
     cout<<"Обчислення опору електричного ланцюга."<<endl; //виводжу через cout та вводжу через cin потрібні дані
     cout<<"Введіть перший резистор: ";
     cin>>res1;
     cout<<"Введіть другий резистор: ";
     cin>>res2;
     double O = 1/((1/res1)+(1/res2)); //задаю змінну типу double, яка = математичній дії
     cout<<"Загальний опір ланцюга: "<<O<<" Ом."; //виводжу даний результат

}
int main(){
    double a, V; //задаю змінні типу double
    cout<<"Обчислення об'єму куба."<<endl; //виводжу та вводжу дані
    cout<<"Введіть довжину ребра (см) і натисніть клавішу <Enter>  ";
    cin>>a;
    V=a*a*a; 
    cout<<"Об'єм куба: "<<V; //виводжу результат
    cout<<" куб.см."<<endl;
    resistance(); //переносимо функцію resistance до головної функції

    return 0;
}