#include <iostream>

using namespace std;

int main() {
    double appleCPG = 0.0152; // 3. В коді використана як мінімум одна дійсна з подвійною точністю змінна
    const int min = 100; int max = 1000; // 1. В коді використана як мінімум одна цілочисельна змінна 4. В коді використана як мінімум одна цілочисельна константа
    for (int i = min; i <= 1000; i += 100) { // 10. В коді використаний for цикл
        double cost = appleCPG * i; // 17. В коді використано математичні операції та математичні функції
        cout << i << " grams of apples will cost you: " << cost << "uah;" << endl; // 21. В коді використано оператори введення та виведення даних
    }
    return 0;
}
