#include <iostream>
#include <ctime>
using namespace std;

int main()
{
    srand(time(0));
    int size = 0;//розмір масиву
    cout << "Enter size: ";
    cin >> size;//введення розміру
    
    int* arr = new int[size];//виділення пам'яті масиву
    
    for(int i = 0; i < size; i++)//цикл для перебору елементів масиву
    {
        arr[i] = rand() % 10;//заповнюємо випадковими значеннями
        cout << arr[i] << " ";//виводимо на консоль
    }
    cout << endl;
    size -= 5;//зменшуємо розмір на 5
    {
        int *arr_new = new int[size];//виділяємо нову память розміром на 5 меншу
        for(int i = 0; i < size; i++)//цикл для перебору елементів масиву
        {
            arr_new[i] = arr[i];//копіюємо потрібні
        }
        delete[]arr;//очищаємо виділину до цього память
        arr = arr_new;//присвоюємо вказівнику на масив адресу нового масиву
    }
    size += 3;//збільшуємо розмір на 3
    {
        int *arr_new = new int[size];//виділяємо нову память розміром на 3 більшу
        for(int i = 0; i < size; i++)//цикл для перебору елементів масиву
        {
            if(i < 3)
                arr_new[i] = arr[i + 1] + 2;//вставляємо перші 3 за умовою
            else
                arr_new[i] = arr[i - 3];//копіюємо потрібні
        }
        delete[]arr;//очищаємо виділину до цього память
        arr = arr_new;//присвоюємо вказівнику на масив адресу нового масиву
    }
    for(int i = 0; i < size; i++)//цикл для перебору елементів масиву
        cout << arr[i] << " ";//виводимо на консоль
    cout << endl;
    delete[]arr;//очищаємо виділину до цього память
    return 0;
}