#include <iostream>
#include <cstdlib>
	
using namespace std;
	
int main()
{
	const int min = 1, max = 10, length = 10; //цілочисельна константа. Створюєм змінні, які матимуть стале значення типу int
	
	int range = max - min + 1; // цілочисельна змінна типу int, для обрахунку розмаху рандомних чисел
	for(int i = 0; i < 3; ++i) // цикл for, для проходження по кожному елементу
	{
	    cout << "Послідовність: "; //оператор виведення. Виводим повідомлення - Послідовність
	
	    int sum = 0; 
	
	    for (int j = 0; j < length; j++) // цикл for, для проходження по кожному елементу
	
	    {
	        int num = rand() % range + min; // цілочисельна змінна типу int. Генеруєм рандомне число в межах від -3 до 3
	
	        cout << num << " "; // Виводим значення num через пробіл
	        sum += num; // додавання значення num до sum
	    }
	    
	    double M = static_cast <double> (sum) / length; // дійсна змінна з подвійною точністю. Відповідь завжди матиме десяткове число, незалежно якого типу даних sum і length
	
	    cout << "Середнє арифметичне: " << M << endl << endl; // оператор виведення. Виводим повідомлення Середнє арифметичне: і виводим значення M
	}
	
	return 0;
}
