#include <iostream>
#include <cmath>
using namespace std;

int main()
{
    //використовую 3 дійсні(дробові) змінні. Одна з них типу float, 2 інші - типу double. Double використовується для запису чисел з подвійною точністю(точніше, ніж тип змінних float)
    //Усі 3 змінні є константного типу, адже не будуть змінені в ході виконання програми(вимоги 2, 3, 4)
    const float a = 0.7;
    const double b = 0.05;
    const double x = 0.043;
    //використовую математичну функцію pow для знаходження степення числа, функцію sqrt для знаходження квадратного кореня, функцію abs для модуля
    // також тригонометричні функції sin i cos(всі з пакету cmath)
    //використано математичні операції +, - і т.д(вимога 17)
    double M = pow(x, 2) * (x + 1) / b;
    double m = pow(sin(x - a), 2);
    double R = M - m;

    double D = sqrt(x * b / a);
    double d = abs(cos(pow(x + b, 3))); 
    double S = D + d;
    //використання оператора виводу cout(з (<<))(вимога 21)
    cout << "R = " << R << endl;
    cout << "S = " << S;

}