#include <iostream>
#include <cmath>
using namespace std;

int main()
{
    const double a = 0.75;
    const double b = 1.19;
    const double c = -2.5;
    const double h = 0.1;
    //використовую цілочисельні константи(цілі числа типу integer, що не будуть змінюватись в ході програми)(вимога 1)
    const int min = 0;
    const int max = 2;
    int counter = 0;
    double y[30][2]; //використовую двовимірний масив(вимога 7) для збереження результатів обчислень для кожного х і самого значення х для ітерації(беру довжину з запасом)
    double x = min;
    while (x <= max) //використовую цикл while для проходження х в проміжку від 0 до 2(вимога 9)
    {
        y[counter][1] = x;
        if (x < 0.5) //використано умовний оператор для створення розгалуження(вимога 5)
        {
            y[counter][0] = a * x + b * cos(x);
            counter++;
        }
        if (x >= 0.5 && x < 1) //використано умовний оператор для створення розгалуження(вимога 5)
        {
            y[counter][0] = b * pow(x, 2) + c * sin(2 * x);
            counter++;
        }
        x = x + h;
        if (x >= 1)
        {
            break; //використовується, щоб цикл автоматично припинявся для х >= 1, адже, хоча проміжок вказано від 0 до 2, функція задана лише для х < 1, при 
                   // чому припиняється не одна ітерація, а весь цикл(вимога 11)
        }
        
    }
    counter = counter - 1; //цикл по стандарту робить на одну ітерацію більше, ніж треба
    for (int i = 0; i < counter; i++) //використовую цикл for з оголошенням лічильника і його автоматичним інкрементом(вимога 10)
    {
        cout << "For x = " << y[i][1] << " : " << " y = " << y[i][0] << endl;
    }
}


