#include <iostream>   // Підключення бібліотеки для введення та виведення даних
#include <cmath>      // Підключення бібліотеки для математичних функцій
using namespace std;  // Використання простору імен std

int main() 
{
    double Z, X = 1, hx = 0.5, A = -0.5, ha = 0.2; // Оголошення та ініціалізація змінних
    
    while (X <= 4) // Цикл while, який працює, поки X менше або рівне 4
    {
        if (A <= -0.5) // Умова перевірки значення A
        {
            // Якщо умова виконується, то:

            A += ha;    // Збільшується A на значення ha
            X += hx;    // Збільшується X на значення hx
            continue;   // Переходить до наступних ітерацій циклу без виконання наступних дій
        }
        
         Z = (sqrt(X - 1.5) + pow(X, A)) / pow(X - 2, 1/3); 
         // Обчислення значення змінної Z за допомогою математичних функцій "pow" і "sqrt"

        cout <<"X= "<<X<<"\t\t"<<"A= "<<A<<"\t\t"<<"Z= "<<Z<<endl; // Вивід значень змінних X, A, Z

        A += ha;       // Збільшується A на значення ha
        X += hx;       // Збільшується X на значення hx
    }

    return 0; // Закінчення програми
}
