#include<iostream>    // Підключення бібліотеки для введення та виведення даних
using namespace std;  // Використання простору імен std

int main()
{
    double X, Y;    // Оголошення та ініціалізація змінних X, Y

    for (X = -2; X <= 2; X += 0.5)
    // Цикл for, який починається з X = -2, ітерується до X = 2 з кроком 0.5.
    {
        Y = -2.4 * X + 5 * X - 3; // Обчислення значень змінної Y за заданим виразом

        cout << "X = " << X <<"\t\t"<< " Y = " << Y << endl; // Вивід значень змінних X і Y
    }

    return 0; // Закінченння програми
}
