#include <iostream> // Підключення бібліотеки для введення та виведення даних
#include <cmath>    // Підключення бібліотеки для математичних функцій
using namespace std; // Використання простору імен std
int main()
{
    double P, Q, X = 0.25, Y = 0.79, Z = 0.81; // Оголошення різних змінних та їх ініціалізація
    
    P = (1 + pow(sin(X + 1),2 )) / (2 + abs(X - 2 * pow(X,3) / (1 + pow(X,2) * pow(Y, 3)))) + pow(X, 4);
    // Обчислення значення P за допомогою математичної функції "pow"

    cout<<"P = "<<P<<endl; // Вивід значення змінної P

    Q = pow(cos(atan(1/Z)), 2); // Обчислення  значення Q за допомогою математичної функції "pow"

    cout<<"Q = "<<Q<<endl; // Вивід значення змінної Q
 
    return 0; // Повернення 0, що свідчить про успішне завершення програми
}
