#include <iostream>
#include <cmath>
using namespace std;

int main()
{
    // Створюємо дійсні змінні x та hx
    float x = -4;
    float hx = 0.5;

    // Виводимо верх таблички
    cout << "x\t|\ty\n\t|\n";

    // Запускаємо цикл while з умовою x <= 4
    while (x <= 4)
    {
        // Створюємо дійсну змінну з подвійною точністю y
        double y;

        // Обчислюємо змінну y заповнюючи її формулою
        y = abs(x - 2) + abs(x + 1);

        // Виводимо число x та y в новому рядку згідо певного формату
        cout << x << "\t|\t" << y << "\n";

        // Збільшуємо x на hx, таким чином за певну кількість ітерацій цикл закічниться, тому що змінна x перестане відповідати його умові
        x += hx;
    }

    return 0;
}