#include <iostream>
#include <cmath>
using namespace std;

int main()
{
    // Створюємо дійсні змінні x та hx
    float x = -5;
    float hx = 1;

    // Запускаємо цикл while з умовою x <= 5
    // Вимога 9
    while (x <= 5)
    {
        // Створюємо дійсну змінну з подвійною точністю y
        double y;

        // Умова (модуль x менший або рівий 3) за якою ми рахуємо функцію y різними формулами.
        // Вимога 5
        if (abs(x) <= 3)
        {
            // Обчислюємо змінну y заповнюючи її формулою
            y = (pow(sin(x + 0.4), 2)) / (4 * pow(x, 2));
        }
        else
        {
            // Обчислюємо змінну y заповнюючи її формулою
            y = pow(x, 4) + 2 * pow(x, 2) * cos(x);
        }
        // Виводимо число x та y в новому рядку згідо певного формату
        cout << "x = " << x << ", y = " << y << "\n";
        // Збільшуємо x на hx, таким чином за 11 ітерацій цикл закічниться, тому що змінна x перестане відповідати його умові
        x += hx;
    }
    return 0;
}