	#include <iostream>
	#include <math.h>
	
	using namespace std;
	
	int main()
	{
	double z, a = 2.4, M, N; // дійсні змінні з подвійною точністю. Створюєм змінні типу double
	int x; // цілочисельна змінна. Створюєм змінну типу int
	    
	cout << "Введіть значення x: "; // оператор виведення. Виводим текст -Введіть значення х:
	cin >> x; // оператор введення. Вводим значення x
	
	if (-3 <= x && x <= 3) // умовний оператор і розгалуження. Перевіряєм умову чи x <= 3 і чи x >= -3
	{
	    x = 0.5;
	    M = pow(a,x) * log(x + pow(2,3)); // математичні операції log, pow. Використовуєм log і pow, для обчислення рівняння  
	    N = x + 1;
	
	    z=M/N;
	
	    cout << "z = " << z << endl; // виводим значення z =
	}
	else
	{	
        cout << "ERROR\n"; // Виводим повідомлення ERROR
	}

  return 0;
}
