//У двовимірному масиві записані слова, що представляють собою 
// послідовність цифр, що завершуються 0. Необхідно роздрукувати слова через 
// кому, взявши надрукований рядок у дужки. Довжина друкованого рядка 60 
// символів. Добування слова оформити у вигляді функції. 
//  Наприклад:
//  вихідні дані - 123023402303450
//  234450234567010
//  234455677670450
//  результат - (123,234,23,345)(23445,234567,1)(23445567767,45)

#include <iostream>

using namespace std;

void word(int mass[3][20]) {
    for (int i=0; i<3; i++) {
        cout << "(";
        for (int j=0; j<20; j++)
        if (mass[i][j]==0) cout << ",";
        else cout << mass[i][j];
        cout << ")";
    }

}    

int main() {
    // for (int i = 0; i < 3; i++) {
    //     for (int j = 0; j < 20; j++) {
    //         cin >> mass[i][j];
    //     }
    //     cout << endl;
    // }                                   - ввід вручну, але то довго
int mass[3][20] = { {1,2,3,0,2,3,4,0,2,3,0,3,4,5,0,4,0,2,3,8},
                    {2,3,4,4,5,0,2,3,4,5,6,7,0,1,0,2,3,4,5,6},
                    {2,3,4,4,5,5,6,7,7,6,7,0,4,5,0,5,6,7,7,6}  };
word(mass);
    return 0;
}


