#include <iostream>
#include <cmath>
#include <cstdarg>
using namespace std;
// Функція для підрахунку кількості точних квадратів серед заданих чисел
int kvadr(int count, ...) {
    int squareCount = 0;
    
    va_list args;  // Ініціалізація змінної args для роботи зі змінним списком аргументів
    va_start(args, count);  // Ініціалізація змінного списку аргументів
    for (int i = 0; i < count; ++i) {
        int num = va_arg(args, int);  // Отримання наступного аргументу зі змінного списку
        int root = static_cast<int>(sqrt(num));  // Обчислення цілочисельного кореня числа
        if (root * root == num) {  //перевіряє чи є число точним квадратом
            squareCount++;
        }
    }
    va_end(args);  // Завершення роботи зі змінним списком аргументів
    return squareCount;
}
int main() {
    // Виклики функції з різною кількістю параметрів
    int resultA = kvadr(3, 2, 4, 9);  // а) для віднімання десяткових дробів
    int resultB = kvadr(7, 16, 25, 36, 49, 64, 81, 100);  // б) для віднімання звичайних дробів
    int resultC = kvadr(11, 121, 144, 169, 196, 225, 256, 289, 324, 361, 400);  // в) для віднімання квадратів чисел
    // Вивід результатів
    cout << "Результат а): " << resultA << " точних квадратів\n";
    cout << "Результат б): " << resultB << " точних квадратів\n";
    cout << "Результат в): " << resultC << " точних квадратів\n";
    return 0;  
} 