#include <iostream>

using namespace std;

int main()
{
    double h, sum; // 2. в коді використана як мінімум одна дійсна змінна
    for (int i = 0; i <= 5; i++) // 10. в коді використаний for цикл 
    {
        if (i == 5) //Вимога 5. коді використані умовні оператори та розгалуження
            break; //Вимога 11. в коді використано оператори break і continue
        cout << "Введіть " << i + 1 << " число: "; // 21. в коді використано оператори виведення та введення даних
        cin >> h; 
        sum += h; // 17. в коді використано математичні операції та математичні функції
        continue; //Вимога 11. в коді використано оператори break і continue
    }
    cout << "Середнє арифметичне: " << sum / 5 << endl; 
    return 0;
}
