#include <iostream>
#include <cmath>

using namespace std;

double power(double x, int n) //Вимога 1. в коді використана як мінімум одна цілочисельна змінна
{ 
    return x * power(x, n - 1); // Вимога 15. в коді використано рекурсивну функцію для піднесення змінної до степеня
}

double power(const int x, int n) //Вимога 4. в коді використана як мінімум одна цілочисельна константа
{
    return x * power(x, n - 1); // Вимога 15. в коді використано рекурсивну функцію для піднесення змінної до степеня
} //Вимога 12. в коді використано перевантаження функції 

int main()
{
    double R, S; //Вимога 2. в коді використана як мінімум одна дійсна змінна для обрахування результату
    double a = 0.7, b = 0.05, x = 0.43; // Вимога 3. в коді використана як мінімум одна дійсний з подвійною точністю змінна
    R = ((pow(x, 2)) * (x + 1)) / b - pow( sin(x - a), 2); //
    S = sqrt((x * b) / a) + fabs(cos(pow((x + b), 3)));// Вимога 17. в коді використано математичні операції та математичні функції (корінь, модуль числа)
    cout << "R: " << R << endl;
    cout << "S: " << S; //Вимога 21. в коді використано оператори виведення та введення даних
    return 0;
}
//Вимога 1. в коді використана як мінімум одна цілочисельна змінна для позначення степеня
