#include <iostream>

using namespace std;

int main()
{
    const double pi = 3.141592; // 3. в коді використана як мінімум одна дійсна з подвійною точністю змінна
    double h, s, r, R1, R2; // 2. в коді використана як мінімум одна дійсна змінна
    double arr[2]; // 6. в коді використаний одновимірний масив 

    cout << "Обчислення площі поверхні циліндра." << endl; // 21. в коді використано оператори виведення та введення даних
    cout << "Введіть початкові дані:" << endl; 
    cout << "Радіус підстави (см) > ";
    cin >> arr[0]; 
    cout << "Висота циліндра (см) > ";
    cin >> arr[1];
    r = arr[0];
    h = arr[1];
    s = 2 * pi * r * r + 2* pi * r * h; // 17. в коді використано математичні операції та математичні функції
    cout << "Площа поверхні циліндра: " << s << " кв.см " << endl; 
    cout << "Опір першого резистора (Ом) > ";
    cin >> R1;
    cout << "Опір другого резистора (Ом) > "; 
    cin >> R2; 
    cout << "Опір кола: " << (R1 + R2) / (R1 * R2) << endl;
    return 0;
}
