#include <iostream>
#include <cmath>
using namespace std;

int main()
{
    //Декларація змінних
    double b = 3.11, a = 0.1;
    //Запускаємо цикл і проходимося по х в межах заданої умови
    for (double x = 0.5; x <= b; x += 0.2)
    {
        //Декларація змінної
        double y = 0.0;
        //Перевірка умов, в разі відповіді true обчислення даної функції
        if (x > 2)
        {
            y = cos(a * x + 2);//функція 1
        }
        else if (x <= 2)
        {
            y = tan(fabs(x - 2 * a));//функція 2
        }
        //Виведення результатів
        cout << "| X = " << x << "\t| Y = " << y << "\t| A = " << a << endl;

        a += 0.3;//змінна, котра збільшується з кожною ітерацією за умовою задачі
    }
    return 0;
}