//Варіант 13. Скласти програму, яка обчислює середнє
//арифметичне послідовності дробових чисел, яка вводиться з
//клавіатури.Кількість чисел повинна задаватися під час роботи
//програми.

#include <iostream>
using namespace std;

int main() {

    //Декларація змінних
    int n;
    double sum = 0;

    //Повідомлення для користувача, щоб той ввів дані (кількість чисел)
    cout << "Enter count num: ";
    cin >> n;


    //Зчитування чисел та додавання їх до суми
    for (int i = 0; i < n; i++) {
        double num;
        cout << "Enter number [" << i + 1 <<"] " << ": ";
        cin >> num;
        sum += num;
    }

    //Обчислення середнього арифметичного
    double average = sum / n;

    //Виведення результату
    cout << "Average: " << average << endl;

    return 0;
}
