#include <iostream> // підключаю бібліотеку для вводу виводу
#include <cmath>//підключаю бібліотеку для необхідних математичних обчислень та використовування тригонометричних функцій
using namespace std;//використовую простір імен std, аби потім не писати всюди std::

int main()
{
    //оголошую і ініціалізую константи необхідні для майбутніх обчислень
    const double x = 0.25;
    const double y = 0.79;
    const double z = 0.81;
    //створюю три проміжні змінні, де по частинах обраховую значення заданого виразу за допомогою формул
    double a = 1 + pow(sin(x + 1), 2);
    double b = abs(x - 2 * pow(x, 3) / (1 + pow(x, 2) * pow(y, 3)));
    double c = pow(x, 4);
    
    double P = a / (2 + b) + c;//обчислюю значення виразу
    double Q = pow(cos(atan(1 / z)), 2);//обчислення другого виразу

    cout << P << " " << Q;//виводжу на консоль значення обрахованих виразів
}