#include <iostream>// підключаю бібліотеку для вводу виводу
#include <cmath>//підключаю бібліотеку для необхідних математичних обчислень та використовування тригонометричних функцій
using namespace std;//використовую простір імен std, аби потім не писати всюди std::

int main()
{
   //оголошую змінні типу double для майбутніх обрахунків
   double x = 0;
   double z = 0;
   double hx = 0.5;
   double ha = 0.2;
   double a;
   cin >> a;//ввід даних 
   if (a > -0.5)//умовний оператор, якщо користувач вводить коректну значення а, виконуємо настурне:
   {
      for (x = 1; x <= 4; x += hx)//використовую цикл з параметром та бінарний оператор "і" а також змінюємо х відповідно до кроку
      {

         if (x <= 2)//умовний оператор
         {
            cout << "It is not possible to calculate" << endl;//вивід тексту в термінал
            a += ha;//змінюємо а відповідно до кроку
            continue;//переходимо до нової ітерації циклу
         }
         z = (pow((x - 1.5), 0.5) + pow(x, a)) / pow((x - 2), 1.0 / 3.0);//обчислюємо вираз за допомогою формул та математичної функції
         cout << z << endl; //виводимо результат
         a = a + ha;//змінюємо а відповідно до кроку
      }
   }
   else//якщо користувач ввів некоректне значення а
   {
      cout << "You entered wrong meaning for a";//вивід тексту в термінал
   }
}