#include <iostream>   // Підключення бібліотеки для введення-виведення в консоль
#include <cmath>      // Підключення бібліотеки для обчислення математичних виразів
using namespace std;  // Використання простору імен для зручності

int main() {
    double a = 1.7;     // Використані дійсні змінні
    double b = 2.3;
    double hx = 0.9;    // Використана дійсна з подвійною точністю змінна
    double hy = 1;

    double x_start = -1; // Використані цілочисельні константи
    double x_end = 1;
    double y_start = -2;
    double y_end = 2;

    for (double x = x_start; x <= x_end; x += hx) {       // Початок зовнішнього циклу for для ітерації по значеннях x
        for (double y = y_start; y <= y_end; y += hy) {   // Початок внутрішнього циклу for для ітерації по значеннях y
            double z; // Оголошення змінної z, яка буде зберігати результат виразу

            if (x * y > 0) {          // Перевірка умови, чи добуток x і y додатній
                z = log(sqrt(a * pow(x, 2) + b * pow(y, 3)));  // Обчислення логарифму від квадратного кореня суми a*x^2 та b*y^3
            } else {
                z = pow(a, x) + pow(b, y);   // Обчислення a^x + b^y, якщо умова не виконується
            }

            cout << "Result for x :" << x << ", y : " << y << " = " << z << endl;  // Вивід результату обчислення на екран
        }
    }

    return 0; // Завершення програми
}
