#include <iostream>  // Підключення бібліотеки для введення-виведення в консоль
#include <cmath>     // Підключення бібліотеки для обчислення математичних виразів
using namespace std;  // Використання простору імен для зручності

int main() {
    // Перше завдання

    double R1, R2;      // Оголошення змінних для зберігання значень опорів
    cout << "Enter the value of the first resistance (Ohm): ";      // Вивід повідомлення про введення значення першого опору
    cin >> R1;      // Зчитування введеного значення опору

    while (R1 <= 15) {      // Перевірка, чи значення першого опору більше 15
        cout << "Value must be greater than 15 ohms. Enter again: ";       // Вивід повідомлення про введення правильного значення
        cin >> R1;     // Зчитування нового значення опору
    }

    cout << "Enter the value of the second resistance (Ohm): ";      // Вивід повідомлення про введення значення другого опору
    cin >> R2;      // Зчитування введеного значення опору

    while (R2 <= 20) { // Перевірка, чи значення другого опору більше 20
        cout << "Value must be greater than 20 ohms. Enter again: ";      // Вивід повідомлення про введення правильного значення
        cin >> R2;    // Зчитування нового значення опору
    }

    double resistance = 1 / ((1 / R1) + (1 / R2));    // Обчислення загального опору

    cout << "Circuit resistance: " << resistance << "Ohm";    // Вивід результату

    // Друге завдання

    double r, h;     // Оголошення змінних для зберігання радіусу та висоти конуса
    
    cout << "\nEnter the radius of the cone: ";     // Вивід повідомлення про введення радіусу конуса
    cin >> r;      // Зчитування введеного радіусу конуса

    cout << "Enter the height of the cone: ";     // Вивід повідомлення про введення висоти конуса
    cin >> h;      // Зчитування введеної висоти конуса

    double volume = (1.0 / 3.0) * 3.14 * pow(r, 2) * h;    // Обчислення об'єму конуса

    cout << "Volume of the cone: " << volume << " cubic centimeters"; // Вивід результату об'єму конуса

    return 0; // Завершення програми
}
