#include <iostream>
using namespace std;

int main() {
    int n; // Оголошення цілочисельної змінної n, яка буде використовуватися для зберігання кількості значень у послідовності
    double sum = 0.0; // Оголошення дійсної змінної sum, яка буде використовуватися для обчислення суми значень у послідовності
    double number; // Оголошення дійсної змінної number, яка буде використовуватися для зберігання введених значень

    cout << "Enter the number of values in the sequence: ";
    cin >> n; // Введення користувачем кількості значень у послідовності

    while (n <= 0) { // Перевірка, чи введена кількість значень є додатною
        cout << "Number of values must be greater than 0. Enter again: ";
        cin >> n; // Повторне введення кількості значень, якщо введено неправильне значення
    }

    double sequence[n]; // Оголошення масиву sequence довжиною n для зберігання введених значень

    int i = 0;
    do {
        cout << "Enter value " << i + 1 << ": ";
        cin >> number; // Введення користувачем значень у послідовності
        sequence[i] = number; // Зберігання значень у масиві sequence
        sum += number; // Додавання введеного значення до суми
        ++i;
    } while (i < n); // Введення значень у послідовності у циклі do-while

    double average; // Оголошення дійсної змінної average для зберігання середнього арифметичного

    if (n > 0) {
        average = sum / n; // Обчислення середнього арифметичного для непорожньої послідовності
        cout << "Average of the sequence: " << average; // Виведення середнього арифметичного
    } else {
        cout << "Cannot calculate average. Division by 0."; // Виведення повідомлення про неможливість обчислення середнього арифметичного для порожньої послідовності
    }

    return 0;
}

