#include <iostream>
#include <cmath>
#include <iomanip>

int main() {
    // Виведення заголовку таблиці
    std::cout << " x    |   y = |x|" << std::endl;
    std::cout << "-------------------" << std::endl;

    // Виведення значень функції для заданого діапазону та кроку
    for (double x = -4.0; x <= 4.0; x += 0.5) {
        double y = std::abs(x);
        // Виведення значень у форматі таблиці
        std::cout << std::fixed << std::setprecision(2) << std::setw(3) << x << " | " << std::setw(4) << y << std::endl;////fixed вказує на використання фіксованого формату для виведення числа з плаваючою комою. Формат фіксованої точності забезпечує постійне відображення заданої кількості знаків після десяткової коми, навіть якщо вони нульові. setw(5) встановлює ширину поля виведення для змінної x як 5 символів. Аналогічно, setw(10) встановлює ширину поля для змінної y як 10 символів. Це використовується для форматування виведення так, щоб значення x та y були вирівняні у вигляді стовпців.В даному випадку, вибрані ширини 5 та 10 символів
    }

    return 0;
}
