// Підключення необхідних бібліотек
#include <iostream>
#include <cmath>

// Визначення константи для числа Пі
const double PI = 3.14159265358979323846;

// Основна функція програми
int main() {
    // Оголошення змінних для радіусів та висоти циліндра
    double r1, r2, h;

    // Виведення повідомлення та отримання значення для радіусу циліндра (r1)
    std::cout << "Введіть радіус циліндра (r1): ";
    std::cin >> r1;

    // Виведення повідомлення та отримання значення для радіусу отвору (r2)
    std::cout << "Введіть радіус отвору (r2): ";
    std::cin >> r2;

    // Виведення повідомлення та отримання значення для висоти циліндра (h)
    std::cout << "Введіть висоту циліндра (h): ";
    std::cin >> h;

    // Обчислення об'єму вихолодженого циліндра за заданими значеннями
    double volume = PI * h * (std::pow(r1, 2) - std::pow(r2, 2));

    // Виведення результату обчислення об'єму на екран
    std::cout << "Об'єм порожнистого циліндра: " << volume << std::endl;

    // Повертається 0, що вказує на успішне завершення програми
    return 0;
}

