#include <iostream>
#include <cmath>

using namespace std;

int main()
{
    // 1. в коді використана як мінімум одна цілочисельна змінна
    int m = 2;
    int c = 1;
    
    //2. в коді використана як мінімум одна дійсна змінна
    double x = 1.2;
    double b = 0.7;

    //3. в коді використана як мінімум одна дійсний з подвійною точністю змінна 
    //17. в коді використано математичні операції та математичні функції
    double fi = sqrt(m * tan(x) + fabs(c * sin(x)));
    double epsilon = m * cos(b * x + sin(x)) + pow(c, 3);

    // 21. в коді використано оператори виведення та введення даних
    cout << "Перший вираз = " << fi << endl;
    cout << "Другий вираз =  " << epsilon << endl;

    return 0;
}
