#include <iostream>

using namespace std;

int main(){
    unsigned long long h[4], d[4], max, min;
    int i;
// вводимо довжини ніжок
    for (i = 0; i < 4; i++){
        cin >> h[i];
    }
// вводимо довжини,які будемо відпилювати
    for (i = 0; i < 4; i++){
        cin >> d[i];
    }
// перевіряємо чи довжина відпилювання не більша за відповідну ніжку
    if (h[0]<d[0] || h[1]<d[1] || h[2]<d[2] || h[3]<d[3]){
        cout << "ERROR";
    } else{
        for (i = 0; i < 4; i++){
// по черзі відпилюємо від ніжок відповідні довжини
            h[i]-=d[i];
            max = h[0];
            min = h[0];
// після кожного відпилювання шукаємо максимальну і мінімальну довжину ніжок
            for (int j = 1; j < 4; j++){
                if (h[j] > max){
                    max = h[j];
                }
            }
            for (int j = 1; j < 4; j++){
                if (h[j] < min){
                    min = h[j];
                }
            }
// та перевіряємо чи максимальна довжина є вдвічі більшою рівна за мінімальну
            if (max >= 2*min){
                cout << "NO" << endl;
                break;
            } else if (i==3){                    
// якщо це остання ітерація циклу, перевіряємо чи всі ніжки рівні після вдалих відпилювань (якщо так - стіл буде паралельний підлозі)
                if (h[0]==h[1] && h[1]==h[2] && h[2]==h[3] && h[0] != 0 && h[1] != 0 && h[2] != 0 && h[3] != 0){
                    cout << "YES";
                } else {
                    cout << "NO";
                }
                     
            }
        }
    }
    return 0;
}