#include <iostream>

using namespace std;

int main()
{
    int L, a, b, c;
    cin >> L; // ввід розміру масиву

    int r[L]; // базовий масив

    for (int i = 0; i < L; i++)
    {
        cin >> r[i]; // заповнення кожного елементу базового масиву
    }

    cin >> a >> b >> c; // ввід 3 елементів які будуть видалені

    if (L < 3)
    {
        cout << 0 << endl;
        return 0;
    }

    int n = 0;
    for (int i = 0; i < L; i++)
    {
        if (r[i] != a && r[i] != b && r[i] != c)
        {
            r[n] = r[i]; // виключення елементів a,b,c з масиву
            n++;
        }
    }

    int w = 1;
    int t[w]; // масив добутку двох елементів

    cout << n - 1 << endl; // розмір масиву добутку двох елементів

    for (int i = 0; i < n - 1; i++)
    {
        t[i] = r[i] + r[i + 1]; // масив добутку двох елементів
        cout << t[i] << " ";    // вивід масиву
    }
    return 0;
}
/*У вас є масив r
розміром N. Також вам дано 3 цілих числа.
Спочатку ви маєте видалити з масиву ці 3 числа, які вам дані. Після цього перетворити цей масив у масив сум, розміром 
Nnew−1(розмір нового масиву після видалення елементів), який буде відображати суми сусідніх елементів нового масиву.
Далі необхідно вивести масив сум на екран.*/
