#include <iostream>
#include <cmath>
	
using namespace std;
	
double current (double m, double n) // використано параметри та аргументи функції, та дійсних змінних. Створюєм функцію типу double з двома аргументами m I n теж типу double
{
	if (n == 0) // використано умовний оператор та розгалуження. Перевіряєм чи n рівне 0
	{
	    cout << "Помилка!!!, опір має бути більший нуля\n"; // Виводим повідомлення Помилка!!!, опір має бути більший нуля
	}
	
	return m / n;
}
	
int main()
{
	int way; // цілочисельна змінна. Створюєм змінну типу int
	double cost, cost_fuel, fuel_consumtion; // дійсні з подвійною точністю. Створюєм змінні типу double
	
	cout << "Відстань до дачі (км): "; // використання оператора виведення. Виводим повідомлення – відстань до дачі (км): 
	cin >> way; // використання оператора введення. Вводим відстань
	cout << "Витрата бензину (літрів на 100 км пробігу): ";// використання оператора виведення. Виводим повідомлення – Витрата бензину (літрів на 100 км пробігу):
	cin >> fuel_consumtion; // використання оператора введення. Вводим витрату пального
	cout << "Ціна літра бензину (грн.): "; // використання оператора виведення. Виводим повідомлення – Ціна літра бензину (грн.):
	cin >> cost_fuel; // використання оператора введення. Вводим ціну бензину
	
	cost = (fuel_consumtion / 100) * way * 2 * cost_fuel; // обчислюєм значення загальної суми поїздки
	
	cout << "Поїздка на дачу і назад обійдеться в " << round(cost * 100)/100 << endl << endl; // використання оператора виведення. Виводим повідомлення – Поїздка на дачу і назад обійдеться в і виводим округлене значення cost
	
	double m, n, p; // створюєм змінні типу double
	
	cout << "Введіть напругу: ";// використання оператора виведення. Виводим повідомлення – Введіть напругу
	cin >> m; // використання оператора введення. Вводим значення m
	cout << "введіть опір: ";// використання оператора виведення. Виводим повідомлення – введіть опір
	cin >> n; // використання оператора введення. Вводим значення n
	
	p = current (m, n); // обчислюєм рівняння, викликаючи функцію current 
	
	cout << "Струм в електричному ланцюгу = " << p << endl; // використання оператора виведення. Виводим повідомлення – Струм в електричному ланцюгу =
	
	    
    return 0;
}
