#include <iostream>
#include <string>

int main() {
    std::string pet_choice;
    std::cout << "Оберіть тваринку з зоомагазину (Собака, Кіт, Хом'як, Папуга, Змія): \n";
    std::cin >> pet_choice;

    while (pet_choice != "Собака" && pet_choice != "Кіт" && pet_choice != "Хом'як" && pet_choice != "Папуга" && pet_choice != "Змія") {
        std::cout << "Оберіть одну з цих тварин (Собака, Кіт, Хом'як, Папуга, Змія)\n";
        std::cin >> pet_choice;
    }

    if (pet_choice == "Собака") {
        std::cout << R"(
        Ця собака точно стане другом сім'ї
        Ціна цієї породи 500$
        Ви отримаєте стартовий набір для догляду)";
    } else if (pet_choice == "Кіт") {
        std::cout << R"(
        Кіт - пристосований до життя в будинку
        Ціна цього кота 300$
        З вами вирушить набір для гігієни)";
    } else if (pet_choice == "Хом'як") {
        std::cout << R"(
        Маленький та пристосований до життя в клітці
        Ціна цього хом'яка 50$
        Вам дадуть початковий набір для утримання)";
    } else if (pet_choice == "Папуга") {
        std::cout << R"(
        Розумна і дружелюбна тварина, вона стане вашим улюбленцем
        Ціна цієї папуги 150$
        Ви отримаєте набір для догляду та годування)";
    } else if (pet_choice == "Змія") {
        std::cout << R"(
        Екзотичний вибір, не потребує багато уваги
        Ціна цієї змії 100$
        Вам дадуть стартовий набір для утримання)";
    }

    return 0;
}