#include<stdio.h>       //Підключаю бібліотеку С (вводу, виводу)
#include <math.h>       //Підключаю бібліотеку математичних функцій

int main(){                //початок функції main
double c, a = 16.5, b = 3.4, x = 0.61, S; //ініціалізація дійсних змінних
puts("Enter number c:");        //виведення стрічки "Enter number c"
scanf("%lf", &c);               //зчитую число 

c = (b*pow(x,2) - c)/((exp(a*x))-1);        //проводжу обрахунок числа c

S =  ((pow(x, 3)*pow(tan(pow((x+b),2)), 2) + a)/(pow(x+b, 0.5))) * c;   //обчислення суми за формулою

printf("Result: %lf", S);   //виведення результату 
    return 0;
}               //завершення функції main