#include <stdio.h>      //Підключаю бібліотеку С (вводу, виводу)

int main(){         //початок функції main
    int a = -4, b = 4;          //ініціалізація цілочисельних змінних та присвоєння їм значень
    double x = a, h = 0.5;      //ініціалізація дійсних змінних та присвоєння їм значень 
    puts("+--------------------------------------+");   //формую верхню межу таблиці
    while(x <= b){              //початок циклу while(оголошення умови циклу)
        double y = x * x - 5 * x - 8;       //ініціалізація змінної та присвоєння їй значення виразу
        printf("| x = %- 2lf |\ty = % -10lf |\n", x, y);        //вивід у таблицю значення x та відповідне йому значення y
        puts("+--------------------------------------+");       //формую проміжні та нижні межі таблиці
        x += h;             //збільшю x на крок h
    }
    puts("\033[31;1m@}\033[0m\033[32;1m->---\033[0m");      //квіточка
    puts("\033[35;1mHave a happy day ;)\033[0m");   
    return 0;
}                           //закінчення функції main