#include <iostream>
#include <cmath>
using namespace std;
int main(){
    double P, Q; // 3. в коді використана як мінімум одна дійсний з подвійною точністю змінна
    float x = 0.25, y = 0.79, z = 0.81; // 2. в коді використана як мінімум одна дійсна змінна
    P = (1 + pow(sin(x+1), 2)) / (2 + abs(x - 2*pow(x,3) / (1 + x*x*y*y*y))) + pow(x,4);
    cout << "P = " << P << endl;
    Q = pow(cos(atan(1/z)), 2); // 17. в коді використано математичні операції та математичні функції
    cout << "Q = " << Q; // 21. в коді використано оператори виведення та введення даних
    return 0;
}