#include <iostream>
#include <cmath> // Підключення бібліотеки cmath для функції округлення

using namespace std;

int main()
{
    // Ініціалізація змінних
    float money;
    int UAH, kop;

    // Запит користувача на введення дробового числа
    cout << "Введіть дробове число > ";
    cin >> money;

    // Цикл для визначення цілої частини введеного числа, тобто гривень
    for(int i = 0; i < money; ++i)
    {
        UAH = i;
    }
    
    kop = round((money - UAH) * 100); // Обчислення кількості копійок (заокругленої дробової частини помноженої на 100)

    // Виведення результатів
    cout << money << " грн. - це " << UAH << " грн. " << kop << " коп." << endl;

    return 0;
}
