#include <iostream>
#include <cmath> // Підключення бібліотеки cmath для математичних обчислень

using namespace std;

int main()
{
    // Ініціалізація змінних
    float x = -3; // Значення для x
    const float h = 0.5; // Значення для h - крок для зміни x

    // Використання циклу while для обчислення та виведення значень z, для x у межах [-3;3]
    while(x <= 3)
    {
        if(x != -1)
        {
            double z = (cos(x) - 1)/(x + 1); // Обчислення значення z
            cout << "x = " << x << " z = " << z << endl; // Виведення результатів (значення x та z)
            x += h; // Збільшення x на крок h
        }
        else
        {
            // Пропуск значення x = -1, оскільки знаменник не має дорівнювати нулю
            x += h; // Збільшення x на крок h
        }
    }

    return 0;
}
