#include <iostream>
#include <cmath> // Підключення бібліотеки cmath для функції піднесення до степеня

using namespace std;

int main()
{
    int x = 10; // Ініціалізація початкового значення x для обчислення квадратів

    // Виведення заголовків колонок
    cout << "   ";
    for(int i = 0; i < 10; ++i)
    {
        cout << i << "   ";
    }
    cout << endl;

    // Виведення таблиці квадратів чисел
    for(int i = 1; i < 10; ++i)
    {
        cout << i << " "; // Виведення номеру рядка

        for(int j = 0; j < 10; ++j)
        {
            cout << pow(x, 2) << " "; // Виведення квадрату числа x
            x += 1; // Інкремент x для наступного числа в рядку
        }

        cout << endl; // Перехід на новий рядок
    }
    
    return 0;
}
