#include <iostream>       //підключаю бібліотеку <iostream>, яка дозволяє підключати потік виведення(cout) і введеня(cin) у програму
#include <cmath>          //підключаю бібліотеку <cmath>, яка містить функції для математичних операцій, такі як std::pow, std::exp, std::cos, std::sin, std::log10, std::fabs
using namespace std;      //підключаю директиву, яка дозволяє використовувати простір імен std(standard) без явного зазначення кожного елемента з цього простору імен

int main()                //початкова функція; вказую нею, що коли програма запуститься, її виконання почнеться саме з цієї функції
{
    double a = 0.5;       //задаю змінні типу double, бо вони є з плаваючою комою (нецілі)
    double b = 2.9;
    double x = 0.3;

    //U
    double n = pow(a, 3) + exp(-x) * cos(b*x);   //задаю змінні, які означають чисельник і знаменник; обчислюю їх за допомогою функцій з бібліотеки 'cmath'
    double d = b*x - exp(-x) * sin(b*x) + 1;

    double U = n/d;      //задаю змінну U і задаю їй значення - ділення n на d (кінцевий результат)

    //F
    double A = fabs(x-b);                 //за допомогою функції fabs шукаю абсолютне значення змінної A типу double
    double p = exp(2*x) * log10(a+x);     //задаю змінні типу double, які будуть використовуватись для обрахунків
    double o = pow(b, 3*x) * log10(A);    //використовує функції з бібліотеки 'cmath'

    double F = p - o;                     //задаю змінну F і задаю їй значення

    
    cout << "U = " << U << endl;   //виводжу у консоль за допомогою об'єкта cout значення шуканих змінних
    cout << "F = " << F << endl;   //використовую endl(end line) для переходу на новий рядок

    return 0;     //повертаю цілочисельне значення 0 операційній системі, як знак успішного завершення програми (0 бо тип повертаючого значення має бути int (цілочисельне))
}
