#include <iostream>     //підключаю бібліотеку <iostream>, яка дозволяє підключати потік виведення(cout) і введеня(cin) у програму
#include <cmath>        //підключаю бібліотеку <cmath>, яка містить функції для математичних операцій, такі як std::pow, std::cos, std::sin, std::fabs
using namespace std;    //підключаю директиву, яка дозволяє використовувати простір імен std(standard) без явного зазначення кожного елемента з цього простору імен

int main()              //початкова функція; вказую нею, що коли програма запуститься, її виконання почнеться саме з цієї функції
{
    double b = 1.5;       //задаю змінні типу double, бо вони є з плаваючою комою (нецілі)

    double xStart = 0.5;
    double xEnd = 3.1;
    double xStep = 0.21;

    double aStart = -0.1;
    double aEnd = -1.4;
    double aStep = 0.1;

    for(double x = xStart; x <= xEnd; x += xStep)      //використовує цикл for, який буде проходитись по всіх x від початкової його границі і до кінця і кожного разу буде добавлятись xStep = 0.21
    {
        for(double a = aStart; a >= aEnd; a -= aStep)  //використовує цикл for, який буде проходитись по всіх a від початкової його границі і до кінця і кожного разу буде добавлятись aStep = 0.1
        {
            double result;                             //задаю змінну, яка буде рахувати результати для кодного випадку

            if(x<b)                                    //за допомогою if перевіряю чи виконується умова x<b
            {
                result = sin(fabs(a*x + pow(b, a)));   //якщо умова виконується, то змінній присвоюється відповідний результат
            }
            else                                       //якщо умова x<b не виконується
            {
                result = cos(fabs(a*x - pow(b, a)));
            }

            cout << "Result for x = " << x << ", a = " << a << ", y = " << result << endl;  //за допомогою cout з бібліотеки 'iostream' вивожу результат для кожного випадку
        }
    }

    return 0;     //повертаю цілочисельне значення 0 операційній системі, як знак успішного завершення програми (0 бо тип повертаючого значення має бути int (цілочисельне))
}
