#include <iostream>
#include <cmath>
#include <string>

using namespace std;

// Загальні відомості:
// В американській системі виміру довжин використовуються ярди, фути, дюйми. 1 Ярд = 3 фути. 1 Фут = 12 дюймів. 1 Дюйм = 2.54 см.
// Футбольні поля мають можуть мати різну довжину
// Довжина: мінімум 100 ярдів, максимум 130 ярдів.
// Ширина: мінімум 50 ярдів, максимум 100 ярдів.

// Використовуючи Ваше прізвище розрахувати найменшу довжину, яка необхідна для розміщення банера з Вашим прізвищем. 
// За умови, що прізвище можна записати лише в 1 ряд, а ширина букви(разом з інтервалом між символами) = кількості голосних букв у Вашому прізвищі * 0.8 метра.
// На основі обчислених розмірів букви визначити символи, які будуть знаходитись на 3-х центральних(по довжині) метрах поля. 
// Обчислення зробити для 2-х випадків:
// 1) при написанні прізвища з лівого краю поля —>  до правого
// 2) при написанні прізвища з правого краю поля <—  до лівого.
// Результат записати.

// Змінні умови завдання.
const double yardCm = 91.44;
const double inchCm = 2.54;
const double minlYard = 100; // Мінімум одна цілочисельна константа.
const double maxlYard = 130;
const double minwYard = 100;
const double maxwYard = 130; 

// Функція для преведення дюймів в см.
double inchtoCm(double inch){
    return inch * inchCm;
}

// Функція для обчислення ширини букв за допомогою визначення к-сть приголосних у моємо призвіщі.
double calcletWidth(const string& surname) {
    int vow = 0; // Мінімум одна цілочисельна змінна.
    for (char ch: surname) { // Цикл for.
        if (tolower(ch) == 'a' || tolower(ch) == 'i' || tolower(ch) == 'e' || tolower(ch) == 'u' || tolower(ch) == 'o') { // Умовний оператор 
            vow++;
        }
    }
    return vow * 0.8; // кількості голосних букв у моєму прізвищі * 0.8 метра.
}
// Функція для преведення ярдів в см.
double yardtocm(double yard){
    return yard * yardCm;
}
// Функція, яка обчислює мін. довжину поля для розміщення банера.
double calcminLength(const string& surname) {
    double letWidth = calcletWidth(surname); // Мінімум одна дійсна змінна:
    return max(minlYard, ceil(yardtocm(letWidth)) / 100); // Мінмальна довжина поля в ярдах.
}


int main() {
    string surname = "Vulchyn"; // Прізвище за умовою - Вульчин
    double minl = calcminLength(surname);
    cout << "Мінімальна довжина поля в ярдах (для банера): " << minl << endl;
    
    // На основі обчислених розмірів букви визначити символи, які будуть знаходитись на 3-х центральних(по довжині) метрах поля. 
    double leftoright = ceil(minl / 2); // 1) при написанні прізвища з лівого краю поля —>  до правого
    double righttoleft = minl - leftoright; // 2) при написанні прізвища з правого краю поля <—  до лівого.

    // Виведення результатів на екран. (Опратори виводу.)
    cout << "Символи, які будуть знаходитись на 3-х центральних метрах поля (лівий край -> правий край): " << leftoright << endl; 
    cout << "Символи, які будуть знаходитись на 3-х центральних метрах поля (правий край -> лівий край): " << righttoleft << endl;

    return 0;
}