#include <iostream>
#include <vector>
#include <string>

using namespace std;

int main() {
    vector<string> назвиКниг = {"Книга 1", "Книга 2", "Книга 3"};
    vector<bool> доступністьКниг = {true, true, true}; // true - книга доступна, false - взята

    int вибір;

    do {
        cout << "Головне меню:\n";
        cout << "1. Перерахувати всі книги\n";
        cout << "2. Взяти книгу\n";
        cout << "3. Повернути книгу\n";
        cout << "4. Вийти\n";

        cout << "Оберіть операцію (1-4): ";
        cin >> вибір;

        switch (вибір) {
            case 1:
                cout << "У бібліотеці " << назвиКниг.size() << " книг:\n";
                for (const auto& назва : назвиКниг) {
                    cout << назва << endl;
                }
                break;

            case 2:
                cout << "Список усіх книг:\n";
                for (const auto& назва : назвиКниг) {
                    cout << назва << endl;
                }

                cout << "Введіть номер книги, яку хочете взяти: ";
                int індексВзяття;
                cin >> індексВзяття;

                if (індексВзяття >= 0 && індексВзяття < назвиКниг.size()) {
                    if (доступністьКниг[індексВзяття]) {
                        cout << "Ви взяли книгу \"" << назвиКниг[індексВзяття] << "\".\n";
                        доступністьКниг[індексВзяття] = false;
                    } else {
                        cout << "Книга вже взята.\n";
                    }
                } else {
                    cout << "Некоректний номер книги.\n";
                }
                break;

            case 3:
                cout << "Список усіх книг:\n";
                for (const auto& назва : назвиКниг) {
                    cout << назва << endl;
                }

                cout << "Введіть номер книги, яку хочете повернути: ";
                int індексПовернення;
                cin >> індексПовернення;

                if (індексПовернення >= 0 && індексПовернення < назвиКниг.size()) {
                    if (!доступністьКниг[індексПовернення]) {
                        cout << "Ви повернули книгу \"" << назвиКниг[індексПовернення] << "\".\n";
                        доступністьКниг[індексПовернення] = true;
                    } else {
                        cout << "Ця книга вже в бібліотеці.\n";
                    }
                } else {
                    cout << "Некоректний номер книги.\n";
                }
                break;

            case 4:
                cout << "До побачення!\n";
                break;

            default:
                cout << "Некоректний ввід. Будь ласка, оберіть існуючу операцію.\n";
        }

        cout << "Бажаєте виконати інші операції? (1 - Так, 0 - Ні): ";
        cin >> вибір;

    } while (вибір != 0);

    return 0;
}