#include <iostream> // підключення бібліотеки для вводу та виводу
#include <cmath> // підключення бібліотеки для математичних операцій
using namespace std;

int main() {
    int n; // оголошення цілочисеьної змінної
    cout << "Введіть кількість членів послідовності:" << endl;
    cin >> n; // введення кількості членів послідовності
    float numbers[100];
    float suma = 0; // ініцілізація змінної
    float average; // оголошення змінної

    cout << "Введіть члени послідовності:" << endl;
    for (int i=0; i<n; i++) {
        cin >> numbers[i]; // введення членів послідовності
        suma += numbers[i]; // обчислення суми членів послідовності
    }

    average = suma / n; // знаходження середнього арифметичного значення введених членів
    cout << "Середнє арифметичне:" << average << endl; // виведення результату
    return 0;
}