#include <iostream> // підключення бібліотеки для вводу та виводу
#include <cmath> // підключення бібліотеки для математичних операцій
using namespace std;

int main() {
    float c, V; // оголошення змінних
    cout << "Введіть довжину ребра (см)" << endl;
    cin >> c; // введення довжини ребра куба
    V = pow(c, 3); // обчислення об'єму куба за формулою
    cout << "Об'єм куба: " << V << " куб. см" << endl; // виведення результату


    float a, b, h, S2; // оголошення змінних
    cout << "Введіть a та b - довжини основ трапеції" << endl;
    cin >> a >> b; // введення довжин основ трапеції
    cout << "Введіть h - довжину висоти трапеції" << endl;
    cin >> h; // введення довжини висоти трапеції
    S2 = ((a + b) / 2) * h; // обчислення площі трапеції за формулою
    cout << "Площа трапеції: " << S2 << " кв. см" << endl; // виведення результату
    return 0;
}