#include <iostream> // підключення бібліотеки для вводу та виводу
#include <cmath> // підключення бібліотеки для математичних операцій
using namespace std;

int main() {
    int x[5], y[5], a, b, R; // оголошення одновимірних масивів та змінних

    cout << "Введіть координати центру:" << endl;
    cin >> a >> b; // ввведення координат центру кола

    cout << "Введіть довжину радіусу:" << endl;
    cin >> R; // ввведення довжини радіусу кола

    cout << "Введіть координати п'яти точок" << endl;
    for (int i=0; i<5; i++) {
        cin >> x[i] >> y[i];
    } // введення координат точок

    for (int i=0; i<5; i++) {
        if (pow(x[i] - a, 2) + pow(y[i] - b, 2) <= pow(R, 2)) {
            cout << x[i] << ";" << y[i] << " " << "потрапила в задане коло" << endl;
    }
    } // перевірка потрапляння введених точок в коло за допомогою рівняння кола

    return 0;
}