
/*Загальні відомості
В американській системі виміру довжин використовуються ярди, фути, дюйми. 1 Ярд = 3 фути. 1 Фут = 12 дюймів. 1 Дюйм = 2.54 см.
Футбольні поля мають можуть мати різну довжину
Довжина: мінімум 100 ярдів, максимум 130 ярдів.
Ширина: мінімум 50 ярдів, максимум 100 ярдів.

// Довжина задається по варіанту 100 - 110 -120 - 130 для кожної групи інший розмір поля. ШІ -11  100 ярдів, ШІ -12 110 ярдів … і т.д.

Використовуючи Ваше прізвище розрахувати найменшу довжину, яка необхідна для розміщення банера з Вашим прізвищем.
 За умови, що прізвище можна записати лише в 1 ряд, а ширина букви(разом з інтервалом між символами) = кількості голосних букв у Вашому прізвищі * 0.8 метра.
На основі обчислених розмірів букви визначити символи, які будуть знаходитись на 3-х центральних(по довжині) метрах поля. 
Обчислення зробити для 2-х випадків:
1) при написанні прізвища з лівого краю поля —>  до правого
2) при написанні прізвища з правого краю поля <—  до лівого.
Результат записати.
*/


#include <iostream>
#include <cstring> // Для використання strtok
using namespace std;

int main() {
    double yards, m, space;
    int vowel = 0; // Ініціалізація лічильника голосних
    char surname[100] = {0}; // Оголошення масиву для зберігання рядка
    char *token; // Вказівник для розділення рядка
    int n; // Змінна для зберігання кількості токенів

    cout << "Введіть прізвище: ";
    cin >> surname;


        for (int j = 0; j<100; j++) {
            if (surname[j] == 'a' || surname[j] == 'e' || surname[j] == 'u' || surname[j] == 'o' || surname[j] == 'y') {
                vowel++;
            }
        }
 yards = 130;
    m = (yards * 3 * 12 * 2.54) / 100;
    cout << "Значення в метрах: " << m << endl;

    space = vowel * 0.8;
    cout << "Значення space: " << space << endl;

    int minimal = 5;
    float distance;
    distance = minimal * space;
    cout << "Значення distance: " << distance << endl;

    return 0;
}
    